Nedu41/SuDepoSis_v2/esp8266_slave/src/main.cpp
// ============================================================
//  BAHÇE SULAMA - SU SEVİYE SİSTEMİ v12
//  ESP8266 12E (NodeMCU) + HC-SR04 + DS1307 RTC + EEPROM + LittleFS
//  + RS485 (ESP32-S3 Master ile haberlesme)
//  + Nano UART0 (kapı ve röle kontrolü)
// ============================================================

#include <ESP8266WiFi.h>
#include <ESP8266WebServer.h>
#include <ESP8266mDNS.h>
#include <Wire.h>
#include <RTClib.h>
#include <EEPROM.h>
#include <LittleFS.h>
#include <ArduinoOTA.h>
#include <ESP8266httpUpdate.h>
#include <WiFiClientSecureBearSSL.h>
#include <Updater.h>
#include <SoftwareSerial.h>
#include <math.h>
#include <time.h>
#include "config.h"
#include "bahce_kapisi.h"
#include "web_content.h" // OTOMATIK URETILIR - bkz scripts/gen_web_content.py

// ============ WiFi AYARLARI (config.h) ============
// AP: SuDepo3T / 18811881 (her zaman acik)
// STA: config.h'dan STA_SSID / STA_PASSWORD

// ============ NESNELER ============
ESP8266WebServer server(80);
RTC_DS1307 rtc;
bool rtcHazir = false;

// ============ KAYIT DOSYALARI ============
const char* KAYIT_DOSYASI = "/kayitlar.csv";
const char* TUKETIM_DOSYASI = "/tuketim.csv";
const char* TUKETIM_GECMIS_DOSYASI = "/tuketim_gecmis.csv";

// ============ EEPROM AYARLARI ============
// EEPROM_SIZE config.h'dan gelir (512) - EEPROM_BOYUT yerine
// struct boyutu 512'den küçük olduğu için taşma olmaz.
// EEPROM_MAGIC config.h'den gelir (0xA543 - WiFi sıfırlama)

struct Ayarlar {
  uint16_t magic;
  float bosMesafe;
  float doluMesafe;
  float depoKapasiteLitre;
  float alarmSeviyeYuzde;
  uint8_t geceBaslangicSaat;
  uint8_t geceBitisSaat;
  uint16_t olcumAraligiGunduz;
  uint16_t olcumAraligiGece;
  float minDolumLitre;
  uint16_t kacakEsikDakika;
  uint8_t depoYatay;
  uint8_t alarmRoleAktif;
  uint8_t alarmTriggerGunduz;  // Gündüz alarm tetikleyicileri (bitmask)
  uint8_t alarmTriggerGece;    // Gece alarm tetikleyicileri (bitmask)
  uint8_t alarmMod;            // 1=Sesli 2=Sessiz 3=Onayli
  uint8_t alarmMaskSesli;      // Sesli mod senaryosu (bitmask)
  uint8_t alarmMaskSessiz;     // Sessiz mod senaryosu (bitmask)
  uint8_t alarmMaskOnayli;     // Onayli mod senaryosu (bitmask)
  uint8_t alarmSensorEtkin;    // Mod/zamandan BAGIMSIZ, her zaman gecerli genel sensor ac/kapa (ALARM_TRIGGER_* bitleri) - kablosuz/arizali sensoru tamamen devre disi birakmak icin
  uint8_t alarmOutputSesli;    // Sesli mod cikislari (bitmask: ALARM_OUTPUT_SIREN|ALARM_OUTPUT_LAMBA)
  uint8_t alarmOutputSessiz;   // Sessiz mod cikislari (bitmask) - varsayilan: sadece lamba
  uint8_t moistureAutomatic;
  uint8_t moistureThresholdLow;
  uint8_t moistureThresholdHigh;
  // SR501 her tetiklenmede ~3sn HIGH kalip ~5sn LOW'a duser (kendi kilitlenme
  // suresi), hareket surdukce bu dongu tekrarlar. Tek darbenin suresi
  // guvenilmez bir sinyal (Time potuna gore degisir), ama tek seferlik
  // gurultunun bir kez, gercek surekli hareketin ise ardarda birden fazla
  // darbe uretmesi guvenilir - bu yuzden pencere icindeki darbe SAYISINA
  // bakiyoruz (bkz. nanoStatusAyristir).
  uint8_t pirPencereSaniye;  // Bu sn'lik pencere icinde darbeler sayilir (0 = filtre yok, ham deger aninda gecerli)
  uint8_t pirMinTetiklenme;  // Pencere icinde PIR tetiklenmis sayilmasi icin gereken minimum ayri darbe sayisi
  // Siren kademeli zamanlama ayari (Konteyner/ESP32 ile ayni mantik, kullanici
  // talebi: "yanlis tetiklerden etkilenmemek icin"). Lamba bu ayarlardan
  // BAGIMSIZ, tetik aninda hemen yanar. Bkz asagidaki state machine (loop()).
  uint16_t sirenGecikmeSaniye;   // ilk chirp'e kadar bekleme (tetik baslangicindan itibaren)
  uint16_t sirenChirpMs;         // chirp suresi (ms)
  uint16_t sirenBeklemeSaniye;   // chirp/aktif-periyot sonrasi sessizlik
  uint16_t sirenAktifSaniye;     // dongudeki tam-aktif kalma suresi
  // YENI ALAN - struct'in EN SONUNA eklendi (EEPROM.put/get struct'i ham
  // bayt olarak yazip okuyor, var olan cihazlardaki eski/kisa EEPROM
  // blob'unun yerlesimini bozmamak icin ortaya degil sona eklenir - eski
  // cihazda bu alan gecersiz/rastgele gelebilir, ayarlariYukle() icinde
  // sanity-clamp edilir, bkz asagida). Eskiden SIREN_MAX_SURE_MS sabit
  // (5dk) idi, artik Konteyner/ESP32 ile ayni mantikla (k_sr_max) web'den
  // 1-30dk ayarlanabilir (kullanici talebi, 2026-09-04: "dis sirenler
  // esp8266'ninki de esp32 gibi calissin").
  uint8_t sirenMaxDakika;        // epizot boyunca kesintisiz azami calma suresi (dk)
  // Toprak nem kontrol penceresi (2026-09-06, struct'in EN SONUNA eklendi -
  // yukaridaki YENI ALAN yorumuyla ayni gerekce). Nem rolesi harici sulama
  // programlayicisinin devresine SERI baglanmis bir NC-kontak kesici -
  // moistureThresholdLow/High bu pencere ICINDE degerlendirilir, disinda
  // role hep de-enerjili kalir. Gun biti: RTClib dayOfTheWeek() (0=Pazar..
  // 6=Cumartesi), 0 = tum gunler pasif/devre disi (varsayilan, kullanici
  // gun secene kadar role hic enerjilenmez).
  // moistureKontrolMagic SART: gunMask==0 sentinel'i eski EEPROM'daki
  // RASTGELE bir baytin 0-127 araliginda dusup "gecerli gun secimi" gibi
  // yanlislikla kabul edilmesine karsi yetersizdi (sahada gorulen bug,
  // 2026-09-06: OTA sonrasi gunMask=127/tum gunler kendiliginden olustu).
  // 16-bit'lik ayri bir magic ile, bu alanlarin GERCEKTEN bu firmware
  // tarafindan yazildigini garanti ediyoruz - uyusmazlikta hepsi guvenli
  // varsayilanlara sifirlanir (bkz ayarlariYukle()).
  uint16_t moistureKontrolMagic;
  uint8_t moistureKontrolGunMask;
  uint8_t moistureKontrolBaslangicSaat;
  uint8_t moistureKontrolBaslangicDakika;
  uint8_t moistureKontrolBitisSaat;
  uint8_t moistureKontrolBitisDakika;
  // Bahce kapisi ACS712 akim sensoru kalibrasyonu (2026-09-10, struct'in EN
  // SONUNA eklendi - yukaridaki YENI ALAN yorumlariyla ayni gerekce). Eskiden
  // config.h'de sabitti (BAHCE_AKIM_SIFIR_RAW/BAHCE_AKIM_ESIK_A), motor
  // baglandiginda sahada kalibre edilebilmesi icin web'den ayarlanabilir
  // yapildi.
  // Her ACS712 modulunun kendi uretim toleransi var (sifir noktasi farkli
  // olabilir), bu yuzden kapi basina AYRI kalibrasyon (2026-09-10, kullanici
  // talebi).
  uint16_t bahceAkim1SifirRaw;  // Kapi1 (SOL) 0A'deki ham ADC okumasi (varsayilan 512)
  uint16_t bahceAkim2SifirRaw;  // Kapi2 (SAG) 0A'deki ham ADC okumasi (varsayilan 512)
  float bahceAkim1EsikA;        // Kapi1 sikisma/asiri akim esigi, Amper (varsayilan 4.0)
  float bahceAkim2EsikA;        // Kapi2 sikisma/asiri akim esigi, Amper (varsayilan 4.0)
};
Ayarlar ayar;

