Nedu41/SuDepoSis_v2/esp8266_slave/src/main.cpp
// WiFi (STA) bilgileri - ayri EEPROM bolgesi, Ayarlar struct'indan bagimsiz
// (bkz. config.h WIFI_EEPROM_ADDR aciklamasi)
struct WifiGecmisKaydi { char ssid[32]; char sifre[32]; };
struct WifiAyarlar {
  uint16_t magic;
  char ssid[32];
  char sifre[32];
  uint16_t gecmisMagic;
  WifiGecmisKaydi gecmis[WIFI_GECMIS_SAYISI];
};
WifiAyarlar wifiAyar;

void wifiGecmisiTemizle() {
  wifiAyar.gecmisMagic = WIFI_GECMIS_MAGIC;
  for (int i = 0; i < WIFI_GECMIS_SAYISI; i++) { wifiAyar.gecmis[i].ssid[0] = '\0'; wifiAyar.gecmis[i].sifre[0] = '\0'; }
}

void wifiAyarlariYukle() {
  EEPROM.begin(EEPROM_SIZE);
  EEPROM.get(WIFI_EEPROM_ADDR, wifiAyar);
  EEPROM.end();
  if (wifiAyar.magic != WIFI_EEPROM_MAGIC) {
    wifiAyar.magic = WIFI_EEPROM_MAGIC;
    wifiAyar.ssid[0] = '\0';
    wifiAyar.sifre[0] = '\0';
    wifiGecmisiTemizle();
  } else {
    wifiAyar.ssid[31] = '\0';
    wifiAyar.sifre[31] = '\0';
    // gecmis alanlari SONRADAN eklendi - eski (kucuk) EEPROM'dan yuklenen
    // cihazlarda bu bayt(lar) gecersiz/rastgele olabilir, ayri magic ile
    // dogrula (bkz config.h WIFI_GECMIS_MAGIC aciklamasi).
    if (wifiAyar.gecmisMagic != WIFI_GECMIS_MAGIC) {
      wifiGecmisiTemizle();
    } else {
      for (int i = 0; i < WIFI_GECMIS_SAYISI; i++) { wifiAyar.gecmis[i].ssid[31] = '\0'; wifiAyar.gecmis[i].sifre[31] = '\0'; }
    }
  }
}

void wifiAyarlariKaydet() {
  EEPROM.begin(EEPROM_SIZE);
  EEPROM.put(WIFI_EEPROM_ADDR, wifiAyar);
  bool ok = EEPROM.commit();
  EEPROM.end();
  DEBUG_PRINTF("[EEPROM] WiFi kaydedildi: %s (SSID=%s, sifreVar=%d)\n", ok ? "OK" : "HATA", wifiAyar.ssid, strlen(wifiAyar.sifre) > 0);
}

// Aktif ag DEGISTIRILMEDEN ONCE eski aktif agi (varsa) gecmise ekler -
// "bagli oldugum aglar hafizada kalsin, listede gorunsun" (2026-09-08
// kullanici talebi). Ayni SSID zaten gecmiste varsa once oradan silinir
// (duplike kayit birikmesin), sonra en basa eklenir - en eski kayit
// WIFI_GECMIS_SAYISI'ni asinca dusurulur.
void wifiGecmiseEkle(const char* ssid, const char* sifre) {
  if (strlen(ssid) == 0) return;
  WifiGecmisKaydi yeni[WIFI_GECMIS_SAYISI];
  strncpy(yeni[0].ssid, ssid, 31); yeni[0].ssid[31] = '\0'; strncpy(yeni[0].sifre, sifre, 31); yeni[0].sifre[31] = '\0';
  int n = 1;
  for (int i = 0; i < WIFI_GECMIS_SAYISI && n < WIFI_GECMIS_SAYISI; i++) {
    if (strcmp(wifiAyar.gecmis[i].ssid, ssid) == 0) continue; // duplike, atla
    if (strlen(wifiAyar.gecmis[i].ssid) == 0) continue;
    yeni[n] = wifiAyar.gecmis[i];
    n++;
  }
  for (int i = 0; i < WIFI_GECMIS_SAYISI; i++) {
    if (i < n) wifiAyar.gecmis[i] = yeni[i];
    else { wifiAyar.gecmis[i].ssid[0] = '\0'; wifiAyar.gecmis[i].sifre[0] = '\0'; }
  }
}

// idx'teki gecmis kaydini AKTIF ag yapar, eski aktif agi gecmise geri
// koyar (basit takas) - "kayitli aglardan birine tikla, baglan" akisi.
bool wifiGecmisiAktifYap(int idx) {
  if (idx < 0 || idx >= WIFI_GECMIS_SAYISI || strlen(wifiAyar.gecmis[idx].ssid) == 0) return false;
  char eskiSsid[32], eskiSifre[32];
  strncpy(eskiSsid, wifiAyar.ssid, 32); strncpy(eskiSifre, wifiAyar.sifre, 32);
  strncpy(wifiAyar.ssid, wifiAyar.gecmis[idx].ssid, 32);
  strncpy(wifiAyar.sifre, wifiAyar.gecmis[idx].sifre, 32);
  wifiAyar.gecmis[idx].ssid[0] = '\0'; wifiAyar.gecmis[idx].sifre[0] = '\0';
  wifiGecmiseEkle(eskiSsid, eskiSifre);
  wifiAyarlariKaydet();
  return true;
}

void wifiGecmisiSil(int idx) {
  if (idx < 0 || idx >= WIFI_GECMIS_SAYISI) return;
  wifiAyar.gecmis[idx].ssid[0] = '\0'; wifiAyar.gecmis[idx].sifre[0] = '\0';
  wifiAyarlariKaydet();
}

void varsayilanAyarlar() {
  ayar.magic = EEPROM_MAGIC;
  ayar.bosMesafe = TANK_EMPTY_CM;
  ayar.doluMesafe = TANK_FULL_CM;
  ayar.depoKapasiteLitre = TANK_CAPACITY_LITERS;
  ayar.alarmSeviyeYuzde = ALARM_THRESHOLD_PERCENT;
  ayar.geceBaslangicSaat = NIGHT_START_HOUR;
  ayar.geceBitisSaat = NIGHT_END_HOUR;
  ayar.olcumAraligiGunduz = DAY_MEASURE_INTERVAL;
  ayar.olcumAraligiGece = NIGHT_MEASURE_INTERVAL;
  ayar.minDolumLitre = MIN_FILL_LITERS;
  ayar.kacakEsikDakika = LEAK_THRESHOLD_MINUTES;
  ayar.depoYatay = TANK_HORIZONTAL;
  ayar.alarmRoleAktif = 1;
  ayar.alarmTriggerGunduz = 0xFF;  // Varsayilan: tüm tetikleyiciler aktif
  ayar.alarmTriggerGece = 0xFF;    // Varsayilan: tüm tetikleyiciler aktif
  ayar.alarmMod = ALARM_MOD_SESLI;
  ayar.alarmMaskSesli = 0xFF;
  ayar.alarmMaskSessiz = 0xFF;
  ayar.alarmMaskOnayli = 0xFF;
  ayar.alarmSensorEtkin = 0xFF; // Varsayilan: tum sensorler aktif
  ayar.alarmOutputSesli = ALARM_OUTPUT_SIREN | ALARM_OUTPUT_LAMBA;
  ayar.alarmOutputSessiz = ALARM_OUTPUT_LAMBA;  // sessiz mod: siren yok, sadece lamba bildirimi
  ayar.moistureAutomatic = 0;
  ayar.moistureThresholdLow = 40;
  ayar.moistureThresholdHigh = 70;
  ayar.pirPencereSaniye = 10;
  ayar.pirMinTetiklenme = 2;
  // Konteyner/ESP32 ile AYNI varsayilanlar (kullanici talebi, 2026-09-04:
  // iki zonun dis sirenleri "ayni mantikla" calissin) - eskiden 5/300/10
  // idi, ESP32'nin 10/300/3'unden farkliydi.
  ayar.sirenGecikmeSaniye = 10;
  ayar.sirenChirpMs = 300;
  ayar.sirenBeklemeSaniye = 3;
  ayar.sirenAktifSaniye = 5; // artik kullanilmiyor (bkz struct yorumu)
  ayar.sirenMaxDakika = 2;
  ayar.moistureKontrolMagic = MOISTURE_KONTROL_MAGIC;
  ayar.moistureKontrolGunMask = 0;  // varsayilan: devre disi, kullanici gun secmeden role hic enerjilenmez
  ayar.moistureKontrolBaslangicSaat = MOISTURE_KONTROL_BASLANGIC_SAAT_VARSAYILAN;
  ayar.moistureKontrolBaslangicDakika = MOISTURE_KONTROL_BASLANGIC_DAKIKA_VARSAYILAN;
  ayar.moistureKontrolBitisSaat = MOISTURE_KONTROL_BITIS_SAAT_VARSAYILAN;
  ayar.moistureKontrolBitisDakika = MOISTURE_KONTROL_BITIS_DAKIKA_VARSAYILAN;
  ayar.bahceAkim1SifirRaw = 512;
  ayar.bahceAkim2SifirRaw = 512;
  ayar.bahceAkim1EsikA = 4.0;
  ayar.bahceAkim2EsikA = 4.0;
}

void ayarlariKaydet() {
  EEPROM.begin(EEPROM_SIZE);
  EEPROM.put(0, ayar);
  // FIX: commit() sonucu kontrol edilmiyordu; yazma hatasinda veri kaybi
  // fark edilmiyordu. Artik debug'ta gercek durum gorunur.
  bool ok = EEPROM.commit();
  EEPROM.end();
  DEBUG_PRINTF("[EEPROM] Kaydedildi: %s\n", ok ? "OK" : "HATA");
}

