Nedu41/SuDepoSis_v2/esp8266_slave/src/main.cpp
// ============ FORWARD DECLARATIONS ============
void tuketimYukle();
void olcumYap();
void kayitlariSiniraGetir(int maxKayit);

// ============ ZAMAN YARDIMCILARI ============
String simdikiZamanStr() {
  if (!rtcHazir) return "RTC yok";
  DateTime now = rtc.now();
  if (now.year() < 2024 || now.year() > 2099) { rtcHazir = false; return "RTC gecersiz"; }
  char buf[24];
  snprintf(buf, sizeof(buf), "%02d/%02d/%04d %02d:%02d:%02d", now.day(), now.month(), now.year(), now.hour(), now.minute(), now.second());
  return String(buf);
}

String simdikiTarihISO() {
  if (!rtcHazir) return "";
  DateTime now = rtc.now();
  if (now.year() < 2024 || now.year() > 2099) return "";
  char buf[16];
  snprintf(buf, sizeof(buf), "%04d-%02d-%02d", now.year(), now.month(), now.day());
  return String(buf);
}

String simdikiYilAy() {
  if (!rtcHazir) return "";
  DateTime now = rtc.now();
  if (now.year() < 2024 || now.year() > 2099) return "";
  char buf[10];
  snprintf(buf, sizeof(buf), "%04d-%02d", now.year(), now.month());
  return String(buf);
}

// ===== Gunluk Alarm Logu (2026-08-27 kullanici talebi, ESP32 Merkez Kontrol
// panelindeki AYNI ozellik - iki arayuz paralel tutulmali). ESP32'nin aksine
// burada RTC YEREL (I2C DS1307) oldugundan RS485 gecikme riski yok - zaman
// dogrudan simdikiZamanStr() ile aninda okunabilir, ayri bir onbellek
// gerekmez. Son 5 kayit RAM'de, tumu LittleFS'e (/alarm_log.csv) kalici.
#define ALARM_TRIGGER_TETIKLEYICI_ADET 6
const char* ALARM_TETIKLEYICI_ADLARI[ALARM_TRIGGER_TETIKLEYICI_ADET] = {
  "Sol Kapi", "Sag Kapi", "PIR", "Su Seviyesi", "Kacak", "Sensor Hatasi"
};
String alarmTetikleyenMetniStr(uint8_t mask, bool panik) {
  if (panik) return "Panik (elle acildi)";
  String l = "";
  for (int i = 0; i < ALARM_TRIGGER_TETIKLEYICI_ADET; i++) {
    if (mask & (1 << i)) { if (l.length()) l += ", "; l += ALARM_TETIKLEYICI_ADLARI[i]; }
  }
  return l.length() ? l : "-";
}

#define ALARM_LOG_RAM_ADET 5
#define ALARM_LOG_DOSYASI "/alarm_log.csv"
#define ALARM_LOG_MAX_SATIR 300 // LittleFS sinirli - asilirsa en eski yarisi silinir

struct AlarmLogKaydi { String zaman; String baslik; String tetikleyen; };
AlarmLogKaydi alarmLogRAM[ALARM_LOG_RAM_ADET];
uint8_t alarmLogRAMDolu = 0;
bool alarmLogOncekiVar = false;
// Ayni tetikleyici pencere icinde tekrar tekrar kayit acmasin (ESP32 Merkez
// Kontrol panelindeki AYNI mantik - iki arayuz paralel tutulmali).
#define ALARM_LOG_TEKRAR_BASTIRMA_MS (5UL * 60UL * 1000UL)
String alarmLogSonTetikleyen = "";
unsigned long alarmLogSonYazmaMs = 0;

void alarmLoguDosyayaEkle(const String& satir) {
  if (LittleFS.exists(ALARM_LOG_DOSYASI)) {
    File f = LittleFS.open(ALARM_LOG_DOSYASI, "r");
    int satirSayisi = 0;
    if (f) { while (f.available()) { f.readStringUntil('\n'); satirSayisi++; } f.close(); }
    if (satirSayisi >= ALARM_LOG_MAX_SATIR) {
      File fr = LittleFS.open(ALARM_LOG_DOSYASI, "r");
      String kalanlar; int atlanacak = satirSayisi / 2, i = 0;
      while (fr.available()) {
        String s = fr.readStringUntil('\n');
        if (i++ >= atlanacak) { kalanlar += s; kalanlar += "\n"; }
      }
      fr.close();
      File fw = LittleFS.open(ALARM_LOG_DOSYASI, "w");
      if (fw) { fw.print(kalanlar); fw.close(); }
    }
  }
  File f = LittleFS.open(ALARM_LOG_DOSYASI, "a");
  if (f) { f.println(satir); f.close(); }
}

void alarmLoguKaydet(const String& baslik, const String& tetikleyen) {
  String zaman = simdikiZamanStr();
  for (int i = ALARM_LOG_RAM_ADET - 1; i > 0; i--) alarmLogRAM[i] = alarmLogRAM[i - 1];
  alarmLogRAM[0] = { zaman, baslik, tetikleyen };
  if (alarmLogRAMDolu < ALARM_LOG_RAM_ADET) alarmLogRAMDolu++;
  String satir = zaman + "," + baslik + "," + tetikleyen;
  satir.replace("\n", " "); satir.replace("\r", " ");
  alarmLoguDosyayaEkle(satir);
}

// loop()'taki ana alarm bloguyla AYNI "aktif mi" hesabi (kucuk, bilerek
// tekrarlanan bir kontrol - ayri bir fonksiyona cikarmak yerine, boylece
// asil alarm/siren state machine'ine hic dokunulmuyor).
void alarmLoguKontrolEt() {
  bool alarmVar = panicRoleAktif || (ayar.alarmRoleAktif && (alarmTetikleyenMask != 0 || alarmOnayBekliyor));
  if (alarmVar && !alarmLogOncekiVar) {
    String baslik = panicRoleAktif ? "PANIK AKTIF" : (alarmOnayBekliyor ? "ALARM - Onay Bekliyor" : "ALARM TETIKLENDI");
    String tetikleyen = alarmTetikleyenMetniStr(alarmTetikleyenMask, panicRoleAktif);
    bool aynisiYakinda = (tetikleyen == alarmLogSonTetikleyen) && (millis() - alarmLogSonYazmaMs < ALARM_LOG_TEKRAR_BASTIRMA_MS);
    if (!aynisiYakinda) {
      alarmLoguKaydet(baslik, tetikleyen);
      alarmLogSonTetikleyen = tetikleyen;
      alarmLogSonYazmaMs = millis();
    }
  }
  alarmLogOncekiVar = alarmVar;
}

bool geceModuMu() {
  if (!rtcHazir) return false;
  DateTime now = rtc.now();
  int saat = now.hour();
  int b = ayar.geceBaslangicSaat, e = ayar.geceBitisSaat;
  if (b == e) return false;
  if (b < e) return (saat >= b && saat < e);
  return (saat >= b || saat < e);
}

// Toprak nem kontrol penceresi icinde miyiz? (bkz struct Ayarlar yorumu,
// config.h MOISTURE_KONTROL_* aciklamasi). Gun maskesi RTClib
// dayOfTheWeek() ile ayni kodlamayi kullanir (0=Pazar..6=Cumartesi).
// Gece penceresinden farkli olarak gece yarisini gecen pencere DESTEKLENMEZ
// (sulama programlayicilari tipik olarak gunduz/aksam calisir, ihtiyac olursa
// genisletilebilir).
bool moistureKontrolPenceresindeMi() {
  if (!rtcHazir) return false;
  if (ayar.moistureKontrolGunMask == 0) return false;
  DateTime now = rtc.now();
  if (!(ayar.moistureKontrolGunMask & (1 << now.dayOfTheWeek()))) return false;
  int simdiDk = now.hour() * 60 + now.minute();
  int baslangicDk = ayar.moistureKontrolBaslangicSaat * 60 + ayar.moistureKontrolBaslangicDakika;
  int bitisDk = ayar.moistureKontrolBitisSaat * 60 + ayar.moistureKontrolBitisDakika;
  if (baslangicDk >= bitisDk) return false;  // gecersiz/sifir genislikte pencere
  return (simdiDk >= baslangicDk && simdiDk < bitisDk);
}

// ============ NANO HABERLESME ============
void nanoBuzzerKontrolPoll(); // asagida tanimli - nanoPoll() bundan once kullaniyor
void nanoMelodiPoll(); // asagida tanimli - nanoPoll() bundan once kullaniyor
// Bekleyen komut kuyruğu - GET_STATUS ile çakışmayı önler
struct NanoPendingCmd {
  String komut;         // "LAMBA_ON", "LAMBA_OFF", vb.
  String ackBeklenen;   // "ACK:LAMBA_ON" vb.
  uint8_t deneme;       // Kaç kez denendi
  unsigned long sonGonderMs;
};
