Nedu41/SuDepoSis_v2/esp8266_slave/src/main.cpp
  // FIX: GET_STATUS yaniti ~85 karakter - 9600 baud'da iletimi tek basina
  // ~90ms suruyor, Nano'nun kendi islem/loop gecikmesi eklenince eskiden
  // buradaki 80ms timeout neredeyse HER ZAMAN yetersiz kaliyordu. Yanit
  // kesiliyor, kuyrukta kalan baytlar asagidaki "temizle" adiminda TAM
  // temizlenemeden PIN_READ gonderiliyordu - bu da PIR okumasini sürekli
  // kirletiyordu (kapi/role/lamba yanitin baslarinda oldugu icin etkilenmiyordu).
  String yanit = nanoYanitOku(200);
  if (yanit.length() > 0) {
    nanoStatusAyristir(yanit);
  } else {
    nanoBaglantiVar = false;
  }
}

bool nanoLambaKontrol(bool ac) {
  // Retry kuyruğuna ekle - GET_STATUS ile çakışmayı önler
  // ACK formatı Nano ile eşleşmeli: "ACK:LAMBA_ON" / "ACK:LAMBA_OFF"
  String komut = ac ? "LAMBA_ON" : "LAMBA_OFF";
  String ack   = ac ? "ACK:LAMBA_ON" : "ACK:LAMBA_OFF";

  // Önceki pending komut varsa iptal et (yeni komut öncelikli)
  pendingCmd = {komut, ack, 0, 0};
  nanoMesgul = true;

  // Optimistik güncelle (UI hemen tepki versin)
  lambaAcik = ac;
  DEBUG_PRINTF("[NANO] Lamba komutu kuyruga alindi: %s\n", komut.c_str());
  return true; // Async - ACK loop'ta işlenecek
}

bool nanoMoistureKontrol(bool ac) {
  // ACK formatı: "ACK:MOISTURE_ON" / "ACK:MOISTURE_OFF"
  String komut = ac ? "MOISTURE_ON" : "MOISTURE_OFF";
  String ack   = ac ? "ACK:MOISTURE_ON" : "ACK:MOISTURE_OFF";

  pendingCmd = {komut, ack, 0, 0};
  nanoMesgul = true;

  moistureOutputActive = ac;
  DEBUG_PRINTF("[NANO] Moisture komutu kuyruga alindi: %s\n", komut.c_str());
  return true;
}

// D12'ye baglanan PASIF buzzer icin - digitalWrite (PIN_WRITE) sabit HIGH/LOW
// verir, pasif buzzer'in ses cikarmasi icin osilasyon (tone()) gerekir. Nano
// tarafina bunun icin ozel TONE_PLAY komutu eklendi (2026-08-27, tek seferlik
// USB reflash ile - genel PIN_WRITE API'si buna yetmiyordu). tone() Nano'da
// kendi zamanlayicisiyla otomatik durur, burada ayrica "kapat" komutu gerekmez.
#define BUZZER_CHIRP_FREKANS_HZ 2500
#define BUZZER_CHIRP_SURE_MS 1000
// Buzzer artik alarm ROLESiNE degil (roleFizikselDurum, mod/cikis secimine
// gore SIRENSIZ de olabiliyordu), asagidaki "BUZZER KURALLARI" blogundaki
// (loop icinde) PIR/kapi/tank/banner kosullarina bagli - orada ihtiyac
// oldukca buzzerChirpBekliyor=true yapilir. Gercek gonderim burada, tek-slot
// seri protokolune uygun (pendingCmd bosken) yapilir.
bool buzzerChirpBekliyor = false;
bool bannerAlarmOncekiDurum = false;

// Nano (ayri MCU, ayri reset hatti) ESP8266 restart/OTA sonrasi FIZIKSEL
// olarak resetlenmiyor - acilis melodisi (acilisSesiCal, Nano setup()'ta)
// o durumda hic duyulmuyordu. Bunun yerine ESP8266 ilk basarili GET_STATUS'ta
// (nanoStatusAyristir icinde melodiIstegiBekliyor=true yapilir) Nano'ya
// MELODY_PLAY komutu gonderip AYNI melodiyi tekrar caldirir (2026-08-27,
// kullanici talebi - "restart'ta melodi olsun, uzun bip degil"). Bayraklar
// yukarida (nanoBaglantiVar yaninda) tanimli - nanoStatusAyristir bunlardan
// once kullaniyor.
void nanoMelodiPoll() {
  if (pendingCmd.komut.length() > 0 || nanoMesgul) return;
  if (!melodiIstegiBekliyor || acilisMelodisiGonderildi) return;
  melodiIstegiBekliyor = false;
  acilisMelodisiGonderildi = true;
  pendingCmd = {"MELODY_PLAY", "ACK:MELODY_PLAY", 0, 0};
  nanoMesgul = true;
}

void nanoBuzzerKontrolPoll() {
  if (pendingCmd.komut.length() > 0 || nanoMesgul) return; // tek-slot protokol - mevcut komutu ezme
  if (!buzzerChirpBekliyor) return;
  buzzerChirpBekliyor = false;
  pendingCmd = {"TONE_PLAY:" + String(NANO_BUZZER_PIN) + "," + String(BUZZER_CHIRP_FREKANS_HZ) + "," + String(BUZZER_CHIRP_SURE_MS), "ACK:TONE_PLAY", 0, 0};
  nanoMesgul = true;
}

void moistureOku() {
  moistureRaw = analogRead(A0);
  moisturePercent = 100.0 - (moistureRaw * 100.0 / 1023.0);
  if (moisturePercent < 0) moisturePercent = 0;
  if (moisturePercent > 100) moisturePercent = 100;
}

// 2026-09-06 kullanici talebi: toprak nemi saniyeler icinde degismez,
// "anlik" okumaya gerek yok - artik otomatik cagrilar (masterGonder/SSE/
// olcumYap) bu sarmalayiciyi kullanir, MOISTURE_OKUMA_ARALIGI_MS'den once
// tekrar analogRead yapmaz. Manuel "Canli Olcum" butonu (handleNemOlc) ve
// kontrol penceresine YENI giris ani (bkz applyMoistureControl cagirani)
// dogrudan moistureOku() cagirip bu araligi atlar - kararin/gostergenin
// tam pencere baslangicinda/manuel testte bayat kalmamasi icin.
unsigned long moistureSonOkumaMs = 0;
void moistureOkuOtomatik() {
  unsigned long simdi = millis();
  if (moistureSonOkumaMs != 0 && simdi - moistureSonOkumaMs < MOISTURE_OKUMA_ARALIGI_MS) return;
  moistureOku();
  moistureSonOkumaMs = simdi;
}

// Kalburum'un hava durumu ozelligi ("yarin yagmur var, bugun sulama atla")
// RS485 ile SET_RAIN_SKIP=1/0 gonderir. Kalici EEPROM alani degil - bilincli
// tercih: Kalburum zaten RS485 uzerinden periyodik tazeler (WiFi/internet
// durumundan bagimsiz, kablo baglantisi surdukce), ESP8266 resetlenirse
// varsayilan "sulama normal calissin" (false) guvenli taraftir. Bayrak,
// Kalburum'dan uzun sure (RAIN_SKIP_STALE_MS) haber alinamazsa da otomatik
// geçersiz sayilir - Kalburum kapali/RS485 hatti kopuk gibi durumlarda
// sulamanin sonsuza kadar yanlislikla engellenmemesi icin (fail-open).
bool yagmurSulamaAtla = false;
unsigned long yagmurSonGuncellemeMs = 0;

bool yagmurSulamaAtlaGecerli() {
  return yagmurSulamaAtla && (millis() - yagmurSonGuncellemeMs < RAIN_SKIP_STALE_MS);
}

// Kalburum'un (ESP32) MPPT'den okudugu aku voltaji kritik esigin altina
// dusunce RS485 ile MASTER:SET_BATTERY_LOW=1 gonderip sulama rolesini
// zorla kapatir - hem otomatik moda hem elle "ac" isteklerine engel olur
// (bkz applyMoistureControl ve rs485KomutDinle icindeki SET_MOISTURE=
// dalı). Voltaj toparlaninca Kalburum SET_BATTERY_LOW=0 gonderip serbest
// birakir - burada ayrica bir "geri ac" mantigi gerekmez, mevcut otomatik/
// manuel akis normal calismaya devam eder.
bool batteryLowOverride = false;

// GUNCELLEME (2026-09-06, kullanici bulgusu): bu fonksiyon eskiden roleyi
// DOGRUDAN VANA SURUCUSU sayiyordu (nem dusukse AC=sula, nem yuksekse
// KAPAT=durdur). Gercek sahada role D5, NC (normalde kapali) kontagi
// kullanilarak harici bir sulama programlayicisinin (haftada 1 gun, sabit
// saatte vana acan ayri bir cihaz) devresine SERI baglanmis bir KESICI -
// dogrudan vana surmuyor. Mantik TAM TERS olmali:
//   - Role DE-ENERJILI (moistureOutputActive=false) -> NC kontak KAPALI ->
//     programlayicinin devresi saglam -> vana kendi programina gore acilabilir
//   - Role ENERJILI (moistureOutputActive=true) -> NC kontak ACIK -> devre
//     KESIK -> vana ACILAMAZ (toprak zaten nemliyken bosuna sulanmasin diye)
// Ayrica role artik SADECE haftalik kontrol penceresinde (bkz
// moistureKontrolPenceresindeMi()) degerlendiriliyor - pencere disinda her
// zaman de-enerjili kalir (nem gunlerce yuksek kalsa bile role gereksiz
// yere enerji harcamaz, sadece programlayicinin calisacagi saatte onemlidir).
void applyMoistureControl() {
  if (batteryLowOverride) {
    if (moistureOutputActive) nanoMoistureKontrol(false);
    return;
  }
  if (!ayar.moistureAutomatic) return;
  // ONCEDEN: sensorHatasi (HC-SR04/tank mesafe sensoru arizali) iken nem
  // otomasyonu TAMAMEN bloke oluyordu - iki sensor (A0 nem, HC-SR04 tank)
  // fiziksel olarak alakasiz oldugu icin bu yanlisti (kullanici bulgusu,
  // 2026-09-04: "nem otomatikte role cekmiyor"). Duzeltme/kullanici karari:
  // sensor hatasinda depoda su olma ihtimali YUKSEK sayilir (fail-open, nem
  // kontrolu normal calisir) - SADECE seviye GECERLI OKUNUP GERCEKTEN sifirsa
  // (tank fiilen bos) vana engellenir (pompayi kuru calistirmamak icin).
  if (!sensorHatasi && sonYuzde <= 0.0f) {
    if (!moistureOutputActive) nanoMoistureKontrol(true);  // tank bos -> vanayi engelle
    return;
  }
  static bool oncekiPencereIcinde = false;
  bool pencereIcinde = moistureKontrolPenceresindeMi();
  if (pencereIcinde && !oncekiPencereIcinde) moistureOku();  // pencereye YENI giris: kararin tazeligi icin saatlik siniri atla
  oncekiPencereIcinde = pencereIcinde;
  if (!pencereIcinde) {
    if (moistureOutputActive) nanoMoistureKontrol(false);  // pencere disi: hep serbest, enerji harcama
    return;
  }
  if (yagmurSulamaAtlaGecerli()) {
    if (!moistureOutputActive) nanoMoistureKontrol(true);  // yarin yagmur bekleniyor -> bu pencerede sulamayi engelle
    return;
  }
  if (moisturePercent >= ayar.moistureThresholdHigh && !moistureOutputActive) {
    nanoMoistureKontrol(true);  // toprak nemli -> vanayi engelle
  } else if (moisturePercent <= ayar.moistureThresholdLow && moistureOutputActive) {
    nanoMoistureKontrol(false);  // toprak kuru -> vanayi serbest birak
  }
}

