Nedu41/SuDepoSis_v2/esp8266_slave/src/main.cpp
      response += "\n";
      rs485Gonder(response.c_str());
      buffer = "";
    } else if (c != '\r') {
      buffer += c;
    }
  }
}

// ============ SILINDIK HACIM ============
float silindirHacimLitre(float y, float cap, float maxL) {
  float r = cap / 2.0;
  if (r <= 0 || maxL <= 0) return 0;
  if (y <= 0) return 0;
  if (y >= cap) return maxL;
  float u = (maxL * 1000.0) / (PI * r * r);
  float p = (r - y) / r;
  if (p > 1) p = 1; if (p < -1) p = -1;
  float k = 2 * r * y - y * y;
  if (k < 0) k = 0;
  float a = r * r * acos(p) - (r - y) * sqrt(k);
  float l = (a * u) / 1000.0;
  if (l < 0) l = 0; if (l > maxL) l = maxL;
  return l;
}

// ============ HC-SR04 ============
float measureDistance() {
  digitalWrite(TRIG_PIN, LOW); delayMicroseconds(2);
  digitalWrite(TRIG_PIN, HIGH); delayMicroseconds(10);
  digitalWrite(TRIG_PIN, LOW);
  long s = pulseIn(ECHO_PIN, HIGH, 30000);
  if (s == 0) return -1;
  float d = s * 0.034 / 2;
  if (d < 2 || d > 450) return -1;
  return d;
}

float olcumOrtalama() {
  float d[3]; int n = 0;
  for (int i = 0; i < 3; i++) {
    float v = measureDistance();
    if (v > 0) d[n++] = v;
    delay(50);
  }
  if (n == 0) return -1;
  if (n == 1) return d[0];
  for (int i = 0; i < n-1; i++)
    for (int j = i+1; j < n; j++)
      if (d[j] < d[i]) { float t = d[i]; d[i] = d[j]; d[j] = t; }
  return d[n/2];
}

// ============ OLCUM ============
void olcumYap() {
  moistureOkuOtomatik();
  applyMoistureControl();
  float m = olcumOrtalama();
  if (m > 0 && m < 500) {
    sensorHatasi = false;
    float kul = ayar.bosMesafe - ayar.doluMesafe;
    if (kul <= 0) kul = 1;
    float s = ayar.bosMesafe - m;
    if (s < 0) s = 0; if (s > kul) s = kul;
    sonSeviyeCm = s;
    if (ayar.depoYatay) {
      sonLitre = silindirHacimLitre(s, kul, ayar.depoKapasiteLitre);
      sonYuzde = (ayar.depoKapasiteLitre > 0) ? (sonLitre / ayar.depoKapasiteLitre) * 100.0 : 0;
    } else {
      sonYuzde = (s / kul) * 100.0;
      sonLitre = (sonYuzde / 100.0) * ayar.depoKapasiteLitre;
    }
    alarmAktif = (sonYuzde <= ayar.alarmSeviyeYuzde);
    sonOlcumZamani = simdikiZamanStr();

    if (ilkOlcumTamamlandi) {
      float oncekiEMA = seviyeEMA;
      seviyeEMA = seviyeEMA + SEVIYE_EMA_AGIRLIK * (sonLitre - seviyeEMA);
      float fark = seviyeEMA - oncekiEMA;
      if (fark > NOISE_ESIK_LITRE) {
        if (!dolumDevamEdiyor) { dolumDevamEdiyor = true; dolumBaslangicLitre = oncekiEMA; dolumBaslangicMs = millis(); }
        dolumSonPikLitre = seviyeEMA;
        kacakSuruyor = false; kacakAlarmi = false;
      } else {
        if (dolumDevamEdiyor) {
          float toplamArtis = dolumSonPikLitre - dolumBaslangicLitre;
          bool yeterinceUzunSurdu = (millis() - dolumBaslangicMs) >= MIN_DOLUM_SURESI_MS;
          if (toplamArtis >= ayar.minDolumLitre && yeterinceUzunSurdu) {
            File f = LittleFS.open(KAYIT_DOSYASI, "a");
            if (f) {
              f.print(simdikiTarihISO()); f.print(",");
              f.print("Otomatik Tespit,"); f.print(toplamArtis, 1); f.print(",0,Belirsiz\n");
              f.close();
              kayitlariSiniraGetir(MAX_KAYIT_SAYISI);
            }
          }
          dolumDevamEdiyor = false;
        }
        if (fark < -NOISE_ESIK_LITRE) {
          float dusus = -fark;
          String simdiTarih = simdikiTarihISO();
          String simdiYilAy = simdikiYilAy();
          if (simdiTarih.length() > 0) {
            if (gunlukTarih.length() > 0 && gunlukTarih != simdiTarih) {
              if (gunlukTuketim > 0) {
                File f = LittleFS.open(TUKETIM_GECMIS_DOSYASI, "a");
                if (f) { f.print(gunlukTarih); f.print(","); f.println(gunlukTuketim, 1); f.close(); }
              }
              gunlukTuketim = 0;
            }
            gunlukTarih = simdiTarih;
            if (aylikYilAy.length() > 0 && aylikYilAy != simdiYilAy) aylikTuketim = 0;
            aylikYilAy = simdiYilAy;
            gunlukTuketim += dusus; aylikTuketim += dusus;
            File f = LittleFS.open(TUKETIM_DOSYASI, "w");
            if (f) {
              f.print(gunlukTarih); f.print(","); f.print(gunlukTuketim, 1); f.print(",");
              f.print(aylikYilAy); f.print(","); f.println(aylikTuketim, 1);
              f.close();
            }
          }
          if (!kacakSuruyor) { kacakSuruyor = true; kacakBaslangicMs = millis(); kacakAlarmi = false; }
          if (!kacakAlarmi && (millis() - kacakBaslangicMs) / 60000UL >= ayar.kacakEsikDakika) kacakAlarmi = true;
        } else {
          kacakSuruyor = false; kacakAlarmi = false;
        }
      }
    } else {
      ilkOlcumTamamlandi = true;
      seviyeEMA = sonLitre;
      tuketimYukle();
    }

    DEBUG_PRINTF("Olcum: %.1f cm (%.1f%%) ~%.0f L\n", sonSeviyeCm, sonYuzde, sonLitre);
  } else {
    sensorHatasi = true;
    DEBUG_PRINTLN("Sensor hatasi!");
  }
}

void tuketimYukle() {
  gunlukTarih = simdikiTarihISO(); aylikYilAy = simdikiYilAy();
  gunlukTuketim = 0; aylikTuketim = 0;
  File f = LittleFS.open(TUKETIM_DOSYASI, "r");
  if (!f) return;
  String satir = f.readStringUntil('\n'); f.close(); satir.trim();
  if (satir.length() == 0) return;
  int p1 = satir.indexOf(','), p2 = satir.indexOf(',', p1+1), p3 = satir.indexOf(',', p2+1);
  if (p1 < 0 || p2 < 0 || p3 < 0) return;
  String t = satir.substring(0, p1); float g = satir.substring(p1+1, p2).toFloat();
  String y = satir.substring(p2+1, p3); float a = satir.substring(p3+1).toFloat();
  if (gunlukTarih.length() > 0 && t == gunlukTarih) gunlukTuketim = g;
  if (aylikYilAy.length() > 0 && y == aylikYilAy) aylikTuketim = a;
}

// ============ KAYIT ISLEMLERI ============
String csvTemizle(String s) { s.replace(",", " "); s.replace("\n", " "); s.replace("\r", " "); return s; }

// Sadece en son MAX_KAYIT_SAYISI kaydi tutar, daha eskileri siler - AMA
// (2026-08-27 kullanici talebi) ELLE GIRILEN kayitlar ASLA silinmez, sadece
// "Otomatik Tespit" (kisi alani tam olarak bu) kayitlari, EN ESKISINDEN
// baslayarak trim edilir. Otomatik kayitlar bitip hala limit asiliysa
// (yani elle girilenlerin kendisi limiti asiyorsa) hicbir sey silinmez -
// kullanicinin kendi girdigi gecmis, nominal sinirdan daha uzun kalabilir.
void kayitlariSiniraGetir(int maxKayit) {
  File f = LittleFS.open(KAYIT_DOSYASI, "r");
  if (!f) return;
  int toplam = 0, otomatikSayisi = 0;
  while (f.available()) {
    String s = f.readStringUntil('\n'); s.trim();
    if (s.length() == 0) continue;
    toplam++;
    if (s.indexOf(",Otomatik Tespit,") >= 0) otomatikSayisi++;
  }
  f.close();
  if (toplam <= maxKayit) return;

  int silinecek = toplam - maxKayit;
  if (silinecek > otomatikSayisi) silinecek = otomatikSayisi; // elle girilenlere dokunma
  if (silinecek <= 0) return;

  File k = LittleFS.open(KAYIT_DOSYASI, "r");
  File g = LittleFS.open("/k_tmp.csv", "w");
  if (!k || !g) { if (k) k.close(); if (g) g.close(); return; }
  int silinen = 0;
  while (k.available()) {
    String s = k.readStringUntil('\n'); s.trim(); if (s.length() == 0) continue;
    if (silinen < silinecek && s.indexOf(",Otomatik Tespit,") >= 0) { silinen++; continue; }
    g.println(s);
  }
  k.close(); g.close();
  LittleFS.remove(KAYIT_DOSYASI); LittleFS.rename("/k_tmp.csv", KAYIT_DOSYASI);
}

bool kayitEkle(String tarih, String kisi, float litre, float ucret, String kaynak) {
  File f = LittleFS.open(KAYIT_DOSYASI, "a");
  if (!f) return false;
  f.print(csvTemizle(tarih)); f.print(",");
  f.print(csvTemizle(kisi)); f.print(",");
  f.print(litre, 1); f.print(",");
  f.print(ucret, 2); f.print(",");
  f.println(csvTemizle(kaynak));
  f.close();
  kayitlariSiniraGetir(MAX_KAYIT_SAYISI);
  return true;
}

String kayitlariOkuJSON(int maxKayit) {
  File f = LittleFS.open(KAYIT_DOSYASI, "r");
  if (!f) return "[]";
  String json = "["; bool ilk = true; int i = 0;
  while (f.available()) {
    String satir = f.readStringUntil('\n'); satir.trim();
    if (satir.length() == 0) continue;
    int p1 = satir.indexOf(','), p2 = satir.indexOf(',', p1+1), p3 = satir.indexOf(',', p2+1), p4 = satir.indexOf(',', p3+1);
    if (p1 >= 0 && p2 >= 0 && p3 >= 0 && p4 >= 0) {
      if (!ilk) json += ",";
      json += "{\"index\":" + String(i) + ",\"tarih\":\"" + satir.substring(0, p1) + "\",\"kisi\":\"" + satir.substring(p1+1, p2) +
           "\",\"litre\":" + satir.substring(p2+1, p3) + ",\"ucret\":" + satir.substring(p3+1, p4) + ",\"kaynak\":\"" + satir.substring(p4+1) + "\"}";
      ilk = false;
    }
    i++; if (i >= maxKayit) break;
  }
  f.close(); json += "]"; return json;
}

struct KayitOzeti {
  float toplamLitre = 0, toplamUcret = 0;
  float ayLitre = 0, ayUcret = 0;
  float ayYagmur = 0, aySebeke = 0, ayTanker = 0;
  int kayitSayisi = 0, belirsizSayisi = 0;
};

void kayitOzet(KayitOzeti& o) {
  File f = LittleFS.open(KAYIT_DOSYASI, "r");
  if (!f) return;
  String by = simdikiYilAy();
  while (f.available()) {
    String satir = f.readStringUntil('\n'); satir.trim();
    if (satir.length() == 0) continue;
    int p1 = satir.indexOf(','), p2 = satir.indexOf(',', p1+1), p3 = satir.indexOf(',', p2+1), p4 = satir.indexOf(',', p3+1);
    if (p1 < 0 || p2 < 0 || p3 < 0 || p4 < 0) continue;
    String th = satir.substring(0, p1);
    float l = satir.substring(p2+1, p3).toFloat(), u = satir.substring(p3+1, p4).toFloat();
    String ky = satir.substring(p4+1);
    o.toplamLitre += l; o.toplamUcret += u; o.kayitSayisi++;
    if (ky == "Belirsiz") o.belirsizSayisi++;
    if (by.length() > 0 && th.startsWith(by)) {
      o.ayLitre += l; o.ayUcret += u;
      if (ky == "Yagmur") o.ayYagmur += l;
      else if (ky == "Sebeke") o.aySebeke += l;
      else if (ky == "Tanker") o.ayTanker += l;
    }
  }
  f.close();
}

bool kayitSil(int idx) {
  File k = LittleFS.open(KAYIT_DOSYASI, "r"); if (!k) return false;
  File g = LittleFS.open("/k_tmp.csv", "w"); if (!g) { k.close(); return false; }
  int i = 0; bool bul = false;
  while (k.available()) {
    String s = k.readStringUntil('\n'); s.trim(); if (s.length() == 0) continue;
    if (i == idx) { bul = true; i++; continue; }
    g.println(s); i++;
  }
  k.close(); g.close();
  LittleFS.remove(KAYIT_DOSYASI); LittleFS.rename("/k_tmp.csv", KAYIT_DOSYASI);
  return bul;
}

bool kayitGuncelle(int idx, String t, String k, float l, float u, String ky) {
  File kD = LittleFS.open(KAYIT_DOSYASI, "r"); if (!kD) return false;
  File g = LittleFS.open("/k_tmp.csv", "w"); if (!g) { kD.close(); return false; }
  int i = 0; bool bul = false;
  while (kD.available()) {
    String s = kD.readStringUntil('\n'); s.trim(); if (s.length() == 0) continue;
    if (i == idx) {
      g.print(csvTemizle(t)); g.print(","); g.print(csvTemizle(k)); g.print(",");
      g.print(l, 1); g.print(","); g.print(u, 2); g.print(","); g.println(csvTemizle(ky));
      bul = true;
    } else { g.println(s); }
    i++;
  }
  kD.close(); g.close();
  LittleFS.remove(KAYIT_DOSYASI); LittleFS.rename("/k_tmp.csv", KAYIT_DOSYASI);
  return bul;
}

// ============ DURUM JSON ============
String durumJson() {
  String j = "{"; // OTA test icin derleme zamani degistirici
  j += "\"firmwareBuild\":\"" __DATE__ " " __TIME__ "\",";
  j += "\"seviye\":" + String(sonSeviyeCm, 1) + ",";
  j += "\"yuzde\":" + String(sonYuzde, 1) + ",";
  j += "\"litre\":" + String(sonLitre, 0) + ",";
  j += "\"zaman\":\"" + sonOlcumZamani + "\",";
  j += "\"alarm\":" + String(alarmAktif ? "true" : "false") + ",";
  j += "\"sensorHata\":" + String(sensorHatasi ? "true" : "false") + ",";
  j += "\"gece\":" + String(geceModuMu() ? "true" : "false") + ",";
  j += "\"kapi1Acik\":" + String(kapi1Acik ? "true" : "false") + ",";
  j += "\"kapi2Acik\":" + String(kapi2Acik ? "true" : "false") + ",";
  j += "\"nanoBagli\":" + String(nanoBaglantiVar ? "true" : "false") + ",";
  j += "\"roleFizikselDurum\":" + String(roleFizikselDurum ? "true" : "false") + ",";
  j += "\"lambaAcik\":" + String(lambaAcik ? "true" : "false") + ",";
  j += "\"moistureRaw\":" + String(moistureRaw) + ",";
  j += "\"moisturePercent\":" + String(moisturePercent, 1) + ",";
  j += "\"moistureOutput\":" + String(moistureOutputActive ? "true" : "false") + ",";
  j += "\"moisturePencerede\":" + String(moistureKontrolPenceresindeMi() ? "true" : "false") + ",";
  j += "\"moistureAuto\":" + String(ayar.moistureAutomatic ? "true" : "false") + ",";
  j += "\"moistureLow\":" + String(ayar.moistureThresholdLow) + ",";
  j += "\"moistureHigh\":" + String(ayar.moistureThresholdHigh) + ",";
  j += "\"gunlukTuketim\":" + String(gunlukTuketim, 1) + ",";
  j += "\"aylikTuketim\":" + String(aylikTuketim, 1) + ",";
  j += "\"kacakAlarmi\":" + String(kacakAlarmi ? "true" : "false") + ",";
  j += "\"kacakDakika\":" + String(kacakSuruyor ? (millis() - kacakBaslangicMs) / 60000UL : 0) + ",";
   j += "\"roleAktif\":" + String(ayar.alarmRoleAktif ? "true" : "false") + ",";
   j += "\"roleTetikli\":" + String(roleFizikselDurum ? "true" : "false") + ",";
   j += "\"lamba\":" + String(lambaAcik ? "true" : "false") + ",";
   j += "\"pirAcik\":" + String(pirAcik ? "true" : "false") + ",";
   j += "\"panicAktif\":" + String(panicRoleAktif ? "true" : "false") + ",";
   j += "\"pirTetikleyici\":" + String(pirTetikleyici ? "true" : "false") + ",";
   j += "\"pirDarbeSayisiPencerede\":" + String(pirDarbeSayisiPencerede) + ",";
   j += "\"alarmTetikleyenMask\":" + String(alarmTetikleyenMask) + ",";
   // Sadece "bilgi amacli" tetikleyiciler (su seviyesi/sensor hatasi) aktifse
   // true - frontend banner'i sade "Onayla" butonuyla gosterir, dis siren/lamba
   // hic tetiklenmez (bkz yukarida ayni istisna, main loop).
   j += "\"alarmBilgiSadece\":" + String((alarmTetikleyenMask != 0 && (alarmTetikleyenMask & ~(ALARM_TRIGGER_SU_SEVIYE | ALARM_TRIGGER_SENSOR)) == 0) ? "true" : "false") + ",";
   j += "\"triggerGunduz\":" + String(ayar.alarmTriggerGunduz) + ",";
   j += "\"triggerGece\":" + String(ayar.alarmTriggerGece) + ",";
   j += "\"alarmMod\":" + String(ayar.alarmMod) + ",";
   j += "\"alarmSusturuldu\":" + String(alarmSusturuldu ? "true" : "false") + ",";
   j += "\"alarmOnayBekliyor\":" + String(alarmOnayBekliyor ? "true" : "false") + ",";
   j += "\"alarmOnaylandi\":" + String(alarmOnaylandi ? "true" : "false") + ",";
   j += "\"alarmOnaySadeceLamba\":" + String(alarmOnaySadeceLamba ? "true" : "false") + ",";
   j += "\"rolePolariteHigh\":" + String(rolePolariteHigh ? "true" : "false") + ",";
   j += "\"yagmurSulamaAtla\":" + String(yagmurSulamaAtlaGecerli() ? "true" : "false");
   j += "}";
  return j;
}

