Nedu41/SuDepoSis_v2/esp8266_slave/src/main.cpp
// ============ CSS ============
void handleCSS() {
  // ESP32 Merkez Kontrol paneliyle AYNI tasarim dili (renk tokenlari, kart/
  // buton/nav/led stilleri) - 2026-08-27 kullanici talebi: iki cihazin web
  // arayuzu gorsel olarak tutarli olsun. Koyu/acik tema burada ESP32'deki
  // gibi prefers-color-scheme DEGIL, mevcut elle-secilen .dark class'iyla
  // calismaya devam ediyor (bu sayfanin zaten calisan tema butonu var).
  String css = ":root{--bg:#f6f8fa;--card:#fff;--text:#1f2937;--muted:#6b7280;--border:#e5e7eb;--border-strong:#4f7fe0;--primary:#2563eb;--accent:#10b981;--warn:#f59e0b;--danger:#ef4444;--danger-bg:#ffebee;--danger-bg-t:rgba(255,235,238,.6);--tab-bg:#eef2f7;--shadow:0 1px 3px rgba(0,0,0,.1);--grid-dot:rgba(79,127,224,.12)}";
  css += ".dark{--bg:#0b1220;--card:#111827;--text:#e5e7eb;--muted:#9ca3af;--border:#374151;--border-strong:#4a72c0;--primary:#60a5fa;--accent:#34d399;--warn:#fbbf24;--danger:#f87171;--danger-bg:#3a2222;--danger-bg-t:rgba(58,34,34,.6);--tab-bg:#1a2433;--shadow:0 1px 3px rgba(0,0,0,.4);--grid-dot:rgba(96,165,250,.16)}";
  css += "*{margin:0;padding:0;box-sizing:border-box}";
  // Simulasyon panosu hissi - ESP32 Merkez Kontrol panelindeki AYNI soluk
  // nokta izgarasi (kullanici talebi, 2026-08-28: "aynı temaları sudepo
  // içinde yap" - iki arayuz gorsel olarak tutarli olsun).
  css += "body{font-family:-apple-system,Segoe UI,Roboto,Arial,sans-serif;background-color:var(--bg);background-image:radial-gradient(var(--grid-dot) 1.2px,transparent 1.2px);background-size:20px 20px;min-height:100vh;padding:12px;color:var(--text);max-width:1100px;margin:0 auto;transition:background .3s,color .3s;-webkit-tap-highlight-color:transparent}";
  css += ".topbar{display:flex;align-items:center;justify-content:space-between;margin-bottom:16px}";
  css += ".topbar h1{font-size:20px;color:var(--text)}";
  css += ".tema-btn{background:var(--card);border:1px solid var(--border);border-radius:50%;width:38px;height:38px;font-size:14px;cursor:pointer;box-shadow:var(--shadow);color:var(--text)}";
  css += ".sekmeler{display:flex;gap:6px;margin-bottom:12px;flex-wrap:wrap;position:sticky;top:0;z-index:100;padding:8px 0;background:rgba(246,248,250,.75);backdrop-filter:blur(6px);-webkit-backdrop-filter:blur(6px)}";
  css += ".dark .sekmeler{background:rgba(11,18,32,.75)}";
  css += ".sekme-btn{padding:8px 12px;border:1px solid var(--border);background:var(--card);color:var(--text);border-radius:8px;cursor:pointer;font-size:13px}";
  css += ".sekme-btn.aktif{background:var(--primary);color:#fff;border-color:var(--primary);font-weight:600}";
  css += ".card{background:var(--card);border:2.5px solid var(--border-strong);border-radius:12px;padding:16px;margin-bottom:12px;box-shadow:var(--shadow)}";
  css += ".card h3{color:var(--text);margin-bottom:8px;font-size:15px;font-weight:700;letter-spacing:.2px}";
  css += ".zaman-bilgisi{color:var(--muted);margin-bottom:10px;font-size:12px;text-align:center}";
  css += ".alarm-kutu{background:rgba(239,68,68,.15);color:var(--danger);border:1px solid rgba(239,68,68,.3);padding:10px;border-radius:8px;margin-bottom:14px;font-weight:700;text-align:center;animation:pulse 1.2s infinite}";
  // Genel alarm banner'i (id alarmGenelKutu) - ESP32 #alarm-banner ile AYNI:
  // sabit, ekranin ortasinda, seffaf+bulanik zemin (altindaki yazi/icerik
  // secilebilsin), sayfa scroll'undan etkilenmez, kaydirma/reflow yapmaz.
  css += "#alarmGenelKutu{position:fixed;top:50%;left:50%;transform:translate(-50%,-50%);z-index:1000;background:var(--danger-bg-t);backdrop-filter:blur(3px);-webkit-backdrop-filter:blur(3px);color:var(--danger);border:2px solid var(--danger);padding:20px 24px;border-radius:12px;font-weight:700;font-size:16px;text-align:center;animation:pulse 1.2s infinite;box-shadow:0 8px 30px rgba(0,0,0,.35);max-width:90vw;width:380px}";
  css += "@keyframes pulse{0%{opacity:1}50%{opacity:.6}100%{opacity:1}}";
  css += ".depo-container{display:flex;justify-content:center;margin:10px 0 20px}";
  css += ".depo{width:170px;height:230px;background:var(--tab-bg);border-radius:20px 20px 10px 10px;position:relative;overflow:hidden;border:3px solid var(--primary)}";
  css += ".su{position:absolute;bottom:0;left:0;right:0;background:linear-gradient(180deg,#42a5f5,#1976d2);transition:height 1s;border-radius:0 0 8px 8px}";
  css += ".su-dalga{position:absolute;bottom:100%;left:-50%;width:200%;height:15px;background:rgba(255,255,255,.3);border-radius:50%;animation:dalga 3s ease-in-out infinite}";
  css += "@keyframes dalga{0%{transform:translateX(0)}50%{transform:translateX(25%) translateY(-5px)}100%{transform:translateX(0)}}";
  css += ".seviye-text{position:absolute;top:50%;left:50%;transform:translate(-50%,-50%);font-size:22px;font-weight:bold;color:#fff;text-shadow:0 2px 10px rgba(0,0,0,.5);z-index:2}";
  css += ".info{padding:14px;background:var(--tab-bg);border-radius:10px;margin:10px 0}";
  // FIX (kullanici sikayeti, 2026-08-27): etiket ("Sol Kapi:" vb.) uzunlugu
  // satirdan satira degistiginden LED/deger farkli x konumlarinda kaliyor,
  // "girintili cikintili" gorunuyordu. ILK DENEME (space-between) LED'i
  // kart kenarina kadar itip etiketten kopardigi icin GERI ALINDI - kullanici
  // "yakinlarda ama hizali" istedi. Cozum: etikete sabit genislik (.info-label),
  // deger/LED hemen ardindan sabit x konumunda baslar (bkz web/index.html'de
  // etiketlerin <span class=info-label> icine alinmasi).
  css += ".info p{margin:6px 0;font-size:14px;display:flex;align-items:center;gap:6px}";
  css += ".info-label{min-width:78px;color:var(--muted)}";
  css += ".info strong{color:var(--primary)}";
  // Dijital 7-segment gostergesi - ESP32 Merkez Kontrol panelindeki .kpi ile
  // AYNI (kullanici talebi, 2026-08-28: "sudepodaki degerlerde dijital yap,
  // kalburumla aynı olsun, tarzımız hep aynı olsun").
  css += ".kpi{font-family:Consolas,'DejaVu Sans Mono','Courier New',monospace;font-size:21px;font-weight:700;letter-spacing:1px;display:inline-block;padding:4px 12px;border-radius:6px;background:#0a0f0a;color:#22ff66;text-shadow:0 0 2px rgba(34,255,102,.9),0 0 8px rgba(34,255,102,.55);border:1px solid #163d1e}";
  css += ".kpi.danger{color:#ff3b3b;text-shadow:0 0 2px rgba(255,59,59,.9),0 0 8px rgba(255,59,59,.55);border-color:#611515;animation:pulse 1.2s infinite}";
  css += ".btn-satir{display:flex;gap:8px;margin:16px 0 6px;flex-wrap:wrap}";
  // Fiziksel panel butonu hissi - ESP32 Merkez Kontrol panelindeki AYNI
  // gloss/kabartma deseni (kullanici talebi, 2026-08-28: "tum projelerde
  // butonlarda daha canli ve gercekci olsun"). Renk siniflari background-color
  // kullanir (background shorthand DEGIL) ki ustteki parlaklik katmani kalsin.
  css += ".btn{flex:1;color:white;padding:10px 12px;border-radius:9px;border:1px solid rgba(0,0,0,.18);font-size:14px;cursor:pointer;font-weight:600;min-width:120px;background-image:linear-gradient(180deg,rgba(255,255,255,.32),rgba(255,255,255,0) 45%,rgba(0,0,0,.10) 100%);box-shadow:0 2px 0 rgba(0,0,0,.22),0 5px 10px rgba(0,0,0,.18),inset 0 1px 0 rgba(255,255,255,.35);transition:transform .08s ease,box-shadow .08s ease,filter .08s ease}";
  css += ".btn:active{transform:translateY(2px);box-shadow:inset 0 2px 5px rgba(0,0,0,.35);filter:brightness(.93)}";
  css += ".btn-yesil{background-color:var(--accent)}.btn-turuncu{background-color:var(--warn);color:#3d2c02}.btn-mavi{background-color:var(--primary);width:100%;margin-top:12px}.btn-kirmizi{background-color:var(--danger);width:100%;margin-top:10px}";
  css += ".btn-satir .btn-mavi,.btn-satir .btn-kirmizi{width:auto;margin-top:0}";
  css += "label{display:block;font-size:12px;color:var(--muted);margin-top:10px}";
  // LED gostergesi - "var/yok" metni yerine kullanilir, ESP32 Merkez Kontrol
  // panelindeki .led ile AYNI (kullanicinin genel arayuz tercihi, tum
  // projelerde uygulanir). RENK ANLAMI (2026-08-27 kullanici duzeltmesi -
  // ayni mantik butun projelerde gecerli): KIRMIZI = ariza/tehlike/anormal
  // durum (ornek: baglanti YOK, kapi ACIK, duman/gaz VAR); YESIL = saglikli/
  // bagli/normal calisiyor (ornek: Nano bagli, role/lamba gorevini yapiyor);
  // SONUK/gri = notr yokluk (alarm tarafinda "tetiklenmedi" gibi). Ayni
  // gostergeyi hem "saglik" hem "alarm" anlaminda ayni renge (orn. hep
  // kirmizi=aktif) baglamak yanlis - "Nano bagli" gibi baglanti gostergeleri
  // .ok (yesil) ile, "kapi acik/duman var" gibi tehlike gostergeleri .on
  // (kirmizi) ile isaretlenir.
  css += ".led{display:inline-block;width:11px;height:11px;border-radius:50%;background:var(--border);vertical-align:middle;transition:background .15s,box-shadow .15s}";
  css += ".led.on{background:var(--danger);box-shadow:0 0 6px var(--danger)}";
  css += ".led.ok{background:var(--accent);box-shadow:0 0 6px var(--accent)}";
  css += ".led.pending{background:var(--warn);box-shadow:0 0 6px var(--warn);animation:pulse 1.2s infinite}";
  // Buyuk panel-LED gostergesi - ESP32 Merkez Kontrol panelindeki .led-big
  // ile AYNI (kullanici talebi, 2026-08-28: "sudepo durum kismindaki
  // sensorlerde kalburum gibi buyuk ledler olsun"). .led ile ayni .on/.ok/
  // .pending kurallarini kullanir, kaynak sirasi .led'den SONRA oldugundan kazanir.
  css += ".led-big{width:17px;height:17px;box-shadow:inset 0 -2px 3px rgba(0,0,0,.35),0 1px 1px rgba(255,255,255,.2);background:radial-gradient(circle at 35% 30%,#7b8494,#374151 75%)}";
  css += ".led-big.on{background:radial-gradient(circle at 35% 30%,#ffc2c2,var(--danger) 55%,#5c0e0e 100%);box-shadow:inset 0 -2px 3px rgba(0,0,0,.3),0 0 6px 2px var(--danger),0 0 14px 5px rgba(239,68,68,.55)}";
  css += ".led-big.ok{background:radial-gradient(circle at 35% 30%,#c3ffdf,var(--accent) 55%,#053f21 100%);box-shadow:inset 0 -2px 3px rgba(0,0,0,.3),0 0 6px 2px var(--accent),0 0 14px 5px rgba(16,185,129,.55)}";
  css += ".led-big.pending{background:radial-gradient(circle at 35% 30%,#ffe9b3,var(--warn) 55%,#5c3d0e 100%);box-shadow:inset 0 -2px 3px rgba(0,0,0,.3),0 0 6px 2px var(--warn),0 0 14px 5px rgba(251,191,36,.55);animation:pulse 1.2s infinite}";
  // Sistem durumu 3 kademeli isik - ESP32 Merkez Kontrol panelindeki .sysdot
  // ile AYNI (normal=yesil, kritik=sari, tehlike=kirmizi soft yanip soner).
  css += ".sysdot{width:15px;height:15px;border-radius:50%;display:inline-block}";
  css += ".sysdot.normal{background:var(--accent);box-shadow:0 0 7px var(--accent)}";
  css += ".sysdot.kritik{background:var(--warn);box-shadow:0 0 7px var(--warn)}";
  css += ".sysdot.tehlike{background:var(--danger);box-shadow:0 0 9px var(--danger);animation:softblink 1.8s ease-in-out infinite}";
  css += "@keyframes softblink{0%,100%{opacity:1}50%{opacity:.3}}";
  // Checkbox gruplari (Zaman Bazli Tetikleyiciler / Mod Senaryolari): checkbox+yazi
  // ayni satirda, dikeyde ortalanmis, birden fazla checkbox yan yana kirilarak dizilir.
  css += ".cb-grid{display:flex;flex-wrap:wrap;gap:6px 18px;align-items:center}";
  css += ".cb-grid p{flex-basis:100%;margin:0 0 4px;color:var(--muted);font-size:12px}";
  css += ".cb{display:flex;align-items:center;gap:6px;margin-top:0;font-size:13px;color:var(--text);width:auto}";
  // NOT: genel "input,select{width:100%;padding:11px;border:...}" kurali
  // checkbox'lari da dev, kenarlikli kutulara ceviriyordu - burada sifirlaniyor.
  css += ".cb input[type=checkbox],.cb input[type=radio]{width:16px;height:16px;flex-shrink:0;padding:0;border:1px solid var(--border);margin:0;background:var(--card)}";
  css += ".cb input[type=checkbox]{border-radius:4px}";
  css += "input,select{padding:10px 12px;border:1px solid var(--border);border-radius:8px;font-size:14px;width:100%;margin-top:4px;background:var(--card);color:var(--text)}";
  css += ".sonuc-metni{margin-top:10px;font-size:13px;text-align:center;color:var(--muted);min-height:16px}";
  css += ".muted{color:var(--muted);font-size:13px;text-align:center;padding:10px 0}";
  css += "table{width:100%;border-collapse:collapse;font-size:12px}";
  css += "th{text-align:left;color:var(--muted);padding:6px 4px;border-bottom:2px solid var(--border)}";
  css += "td{padding:8px 4px;border-bottom:1px solid var(--border)}";
  css += ".belirsiz-satir{background:rgba(255,152,0,.12)}";
  css += ".uyari-metni{color:var(--warn);font-weight:bold}";
  css += ".duzenle-form{display:flex;flex-wrap:wrap;gap:6px;padding:8px 0}";
  css += ".duzenle-form select,.duzenle-form input{flex:1;min-width:90px;margin-top:0;padding:8px}";
  css += ".duzenle-form button{width:auto;margin-top:0;padding:8px 14px}";
  css += ".btn-sil{background:none;border:none;cursor:pointer;font-size:14px}";
  // Ayarlar/Alarm sekmelerindeki kartlar <details> oldugundan (ESP32'deki
  // acilir-kapanir Ayarlar deseniyle AYNI) - kenarlari daha belirgin.
  css += "details.card{padding:0}";
  // Acilir-kapanir kartlarin her biri kendi renginde sol kenarla ayirt
  // edilsin - ESP32 Merkez Kontrol panelindeki AYNI palet/mantik (2026-08-27,
  // "iki arayuz paralel" kurali).
  const char* kenarRenkleri[12] = {"#3b82f6","#06b6d4","#14b8a6","#f97316","#84cc16","#8b5cf6","#ec4899","#6366f1","#64748b","#f43f5e","#eab308","#22c55e"};
  for (int i = 0; i < 12; i++) {
    css += "details.card:nth-of-type(" + String(i + 1) + "){border-left:7px solid " + kenarRenkleri[i] + "}";
  }
  css += "details.card>summary{cursor:pointer;list-style:none;display:flex;align-items:center;gap:7px;padding:16px;margin-bottom:0;font-size:15px;font-weight:700;color:var(--text);letter-spacing:.2px}";
  css += "details.card>summary::-webkit-details-marker{display:none}";
  css += "details.card>summary::before{content:'\\25B8';display:inline-block;font-size:12px;color:var(--muted);transition:transform .15s}";
  css += "details.card[open]>summary::before{transform:rotate(90deg)}";
  css += "details.card>*:not(summary){margin-left:16px;margin-right:16px}";
  css += "details.card>summary{margin-left:0;margin-right:0}";
  css += "details.card>*:last-child{margin-bottom:16px}";
  css += "details.card>h3:first-of-type,details.card>p:first-of-type{margin-top:16px}";
  server.sendHeader("Cache-Control", "no-cache, no-store, must-revalidate");
  server.send(200, "text/css", css);
}

// ============ HTML/JS (firmware'e gomulu - bkz web_content.h) ============
// index.html ve app.js artik LittleFS'te ayri dosyalar degil, derleme
// sirasinda scripts/gen_web_content.py tarafindan uretilen web_content.h
// icinde PROGMEM sabiti olarak firmware'in kendi icinde. Dinamik degerler
// JS tarafinda /olc, /durum, /ayarlar API'lerinden cekilir.
void handleRoot() {
  // FIX: tarayici (ozellikle mobil) bu sayfayi/JS'i cache'leyip guncellemeleri
  // gostermeyebiliyordu - Cache-Control tek basina yetersiz kalabiliyordu,
  // Pragma/Expires de eklendi (eski/agresif mobil cache'ler icin).
  server.sendHeader("Cache-Control", "no-cache, no-store, must-revalidate");
  server.sendHeader("Pragma", "no-cache");
  server.sendHeader("Expires", "0");
  server.send_P(200, "text/html", INDEX_HTML);
}


// ============ SSE PUSH ============
void ssePush() {
  if (!sseAktif) return;
  if (!sseClient.connected()) { sseAktif = false; return; }
  String data = "data: " + durumJson() + "\n\n";
  sseClient.print(data);
}

void handleSSE() {
  if (sseAktif) { sseClient.stop(); sseAktif = false; }
  sseClient = server.client();
  sseClient.setNoDelay(true);
  sseClient.print(
    "HTTP/1.1 200 OK\r\n"
    "Content-Type: text/event-stream\r\n"
    "Cache-Control: no-cache\r\n"
    "Connection: keep-alive\r\n"
    "Access-Control-Allow-Origin: *\r\n"
    "\r\n"
  );
  sseAktif = true;
  ssePush();  // ilk veriyi hemen gönder
}

