Nedu41/SuDepoSis_v2/esp8266_slave/src/main.cpp
// ============ API ROTALARI ============
void handleRestart() {
  // FIX (kullanici sikayeti, 2026-08-27): 100ms gecikme cok kisaydi -
  // server.send() yaniti TCP gonderim kuyruguna koyar ama WiFi uzerinden
  // fiilen iletilip tarayiciya ULASMASI icin zaman gerekir; ESP.restart()
  // bunu beklemeden baglantiyi sert kesince tarayicidaki fetch() ne
  // basariya ne hataya duser, sonsuza kadar "Yeniden baslatiliyor..."
  // yazili kalir (ayni sorun performOTA()'da da vardi, orada da duzeltildi).
  server.send(200, "application/json", "{\"basarili\":true,\"mesaj\":\"Yeniden baslatiliyor\"}");
  server.client().flush();
  delay(500);
  ESP.restart();
}
void handleMeasure() { olcumYap(); ssePush(); server.send(200, "application/json", durumJson()); }
void handleStatus() { moistureOkuOtomatik(); if (ayar.moistureAutomatic) applyMoistureControl(); server.send(200, "application/json", durumJson()); }
// 2026-09-06: Ayarlar > Nem Ayarlari "Canli Olcum" butonu icin - hourly
// sinirlamayi ATLAYIP aninda taze analogRead yapar (saha testi/kalibrasyon).
void handleNemOlc() { moistureOku(); moistureSonOkumaMs = millis(); server.send(200, "application/json", "{\"moisturePercent\":" + String(moisturePercent, 1) + ",\"moistureRaw\":" + String(moistureRaw) + "}"); }
void handleTime() {
  // Kullanici talebi (2026-09-04): "Zaman" butonu basilinca kayitli saati
  // DEGISTIRMEDEN (sifirlamadan) sadece RTC ile I2C iletisimini yeniden
  // baslatsin - rtcHazir daha once (pil/I2C sorunu) false'a dustuyse chip
  // fiziksel takiliysa/duzeldiyse bu butonla kurtarilabilir, sonraki rtc.now()
  // cagrisi (simdikiZamanStr icinde) guncel cipteki degeri okur.
  rtcHazir = rtc.begin();
  // Kullanici talebi (2026-09-07): STA (ev WiFi) baglantisi varsa RTC'yi
  // internetten (NTP) otomatik guncelle - Turkiye 2016'dan beri yaz saati
  // uygulamiyor, sabit UTC+3 (10800sn) yeterli. STA yoksa (sadece AP) veya
  // NTP zaman asimina ugrarsa RTC'ye DOKUNULMAZ, sadece mevcut deger okunur.
  bool ntpSenkron = false;
  if (WiFi.status() == WL_CONNECTED) {
    configTime(10800, 0, "pool.ntp.org", "time.google.com");
    time_t simdi = time(nullptr);
    unsigned long t0 = millis();
    while (simdi < 1700000000 && millis() - t0 < 3000) {  // 2023-11 sonrasi = NTP basarili kabul edilir
      delay(100);
      simdi = time(nullptr);
    }
    if (simdi >= 1700000000 && rtcHazir) {
      struct tm tmS;
      localtime_r(&simdi, &tmS);
      rtc.adjust(DateTime(tmS.tm_year + 1900, tmS.tm_mon + 1, tmS.tm_mday, tmS.tm_hour, tmS.tm_min, tmS.tm_sec));
      ntpSenkron = true;
    }
  }
  String json = "{\"zaman\":\"" + simdikiZamanStr() + "\",\"tarihISO\":\"" + simdikiTarihISO() + "\",\"ntpSenkron\":" + String(ntpSenkron ? "true" : "false") + "}";
  server.send(200, "application/json", json);
}
void handleSetTime() {
  String m = "Hata!"; bool b = false;
  if (server.hasArg("zaman")) {
    String z = server.arg("zaman");
    if (z.length() >= 16) {
      if (rtcHazir) {
        int y = z.substring(0,4).toInt(), a = z.substring(5,7).toInt(), g = z.substring(8,10).toInt(), s = z.substring(11,13).toInt(), d = z.substring(14,16).toInt(), sn = z.length()>=19?z.substring(17,19).toInt():0;
        rtc.adjust(DateTime(y,a,g,s,d,sn));
        m = "Zaman ayarlandi"; b = true;
      } else {
        m = "RTC yok";
      }
    } else m = "Format!";
  }
  server.send(200, "application/json", "{\"mesaj\":\"" + m + "\",\"basarili\":" + String(b?"true":"false") + "}");
}
// handleGetSettings (form doldurma) VE /ayarlar/yedekle (dosyaya indirme)
// ORTAK KULLANIR - alan adlari handleSaveSettings'in bekledigi query
// parametre adlariyla BIREBIR AYNI olmali (yedek dosyasi geri yuklenirken
// ayni adlarla /ayarlar/kaydet'e POST edilir, bkz web/app.js).
String ayarlarJSON() {
  String j = "{";
  j += "\"bosMesafe\":" + String(ayar.bosMesafe,1) + ",\"doluMesafe\":" + String(ayar.doluMesafe,1) + ",\"kapasite\":" + String(ayar.depoKapasiteLitre,0) + ",\"alarmYuzde\":" + String(ayar.alarmSeviyeYuzde,0) + ",\"geceBaslangic\":" + String(ayar.geceBaslangicSaat) + ",\"geceBitis\":" + String(ayar.geceBitisSaat) + ",\"minDolumLitre\":" + String(ayar.minDolumLitre,0) + ",\"kacakEsikDakika\":" + String(ayar.kacakEsikDakika) + ",\"depoYatay\":" + String(ayar.depoYatay) + ",\"moistureAutomatic\":" + String(ayar.moistureAutomatic ? "true" : "false") + ",\"moistureThresholdLow\":" + String(ayar.moistureThresholdLow) + ",\"moistureThresholdHigh\":" + String(ayar.moistureThresholdHigh) + ",\"triggerGunduz\":" + String(ayar.alarmTriggerGunduz) + ",\"triggerGece\":" + String(ayar.alarmTriggerGece) + ",\"alarmMod\":" + String(ayar.alarmMod) + ",\"alarmSensorEtkin\":" + String(ayar.alarmSensorEtkin) + ",\"alarmMaskSesli\":" + String(ayar.alarmMaskSesli) + ",\"alarmMaskSessiz\":" + String(ayar.alarmMaskSessiz) + ",\"alarmMaskOnayli\":" + String(ayar.alarmMaskOnayli) + ",\"alarmOutputSesli\":" + String(ayar.alarmOutputSesli) + ",\"alarmOutputSessiz\":" + String(ayar.alarmOutputSessiz) + ",\"pirPencereSaniye\":" + String(ayar.pirPencereSaniye) + ",\"pirMinTetiklenme\":" + String(ayar.pirMinTetiklenme) + ",\"sirenGecikmeSaniye\":" + String(ayar.sirenGecikmeSaniye) + ",\"sirenChirpMs\":" + String(ayar.sirenChirpMs) + ",\"sirenBeklemeSaniye\":" + String(ayar.sirenBeklemeSaniye) + ",\"sirenAktifSaniye\":" + String(ayar.sirenAktifSaniye) + ",\"sirenMaxDakika\":" + String(ayar.sirenMaxDakika) + ",\"moistureKontrolGunMask\":" + String(ayar.moistureKontrolGunMask) + ",\"moistureKontrolBaslangicSaat\":" + String(ayar.moistureKontrolBaslangicSaat) + ",\"moistureKontrolBaslangicDakika\":" + String(ayar.moistureKontrolBaslangicDakika) + ",\"moistureKontrolBitisSaat\":" + String(ayar.moistureKontrolBitisSaat) + ",\"moistureKontrolBitisDakika\":" + String(ayar.moistureKontrolBitisDakika) + ",\"bahceAkim1SifirRaw\":" + String(ayar.bahceAkim1SifirRaw) + ",\"bahceAkim2SifirRaw\":" + String(ayar.bahceAkim2SifirRaw) + ",\"bahceAkim1EsikA\":" + String(ayar.bahceAkim1EsikA, 1) + ",\"bahceAkim2EsikA\":" + String(ayar.bahceAkim2EsikA, 1) + "}";
  return j;
}
void handleGetSettings() {
  server.send(200, "application/json", ayarlarJSON());
}
// bahce_kapisi.cpp icin kopru - struct Ayarlar'in tanimi burada (main.cpp'de)
// oldugundan, extern struct yerine basit getter fonksiyonlariyla erisim
// sagliyoruz (bkz bahce_kapisi.h).
uint16_t bahceAkimSifirRawGetir(int kapiIndex) { return kapiIndex == 0 ? ayar.bahceAkim1SifirRaw : ayar.bahceAkim2SifirRaw; }
float bahceAkimEsikAGetir(int kapiIndex) { return kapiIndex == 0 ? ayar.bahceAkim1EsikA : ayar.bahceAkim2EsikA; }
// 2026-09-08 kullanici talebi: ayarlari bilgisayara dosya olarak kaydedip
// (yedek) sonradan geri yukleyebilme. Indirme: mevcut ayarlarJSON() +
// Content-Disposition ile tarayici otomatik dosya olarak kaydeder. Geri
// yukleme icin ayri bir endpoint YOK - web/app.js bu JSON'u okuyup ayni
// alan adlariyla mevcut /ayarlar/kaydet'e POST eder (handleSaveSettings).
void handleAyarlarYedekle() {
  server.sendHeader("Content-Disposition", "attachment; filename=sudepo_ayarlar.json");
  server.send(200, "application/json", ayarlarJSON());
}
// TUM ayarlari (kalibrasyon, alarm, siren, nem - varsayilanAyarlar() ile
// AYNI kapsam) kod-ici sabit varsayilanlara dondurur - "fabrika ayarlarina
// don" (2026-09-08 kullanici talebi, her iki cihazda da olsun). WiFi bilgisi
// (ayri EEPROM bolgesi) ETKILENMEZ.
void handleAyarlarFabrikaDondur() {
  varsayilanAyarlar();
  ayarlariKaydet();
  server.send(200, "application/json", "{\"basarili\":true,\"mesaj\":\"Tum ayarlar fabrika degerlerine sifirlandi\"}");
}
// Nem kontrolu ayarlarini (esikler + haftalik pencere) kod-ici sabit
// varsayilanlara dondurur - "fabrika ayarlarina don" (2026-09-08 kullanici
// talebi). Diger ayar gruplarina (alarm/siren/tank vb) DOKUNMAZ.
void handleNemFabrikaAyarlari() {
  ayar.moistureThresholdLow = 40;
  ayar.moistureThresholdHigh = 70;
  ayar.moistureKontrolGunMask = 0;
  ayar.moistureKontrolBaslangicSaat = MOISTURE_KONTROL_BASLANGIC_SAAT_VARSAYILAN;
  ayar.moistureKontrolBaslangicDakika = MOISTURE_KONTROL_BASLANGIC_DAKIKA_VARSAYILAN;
  ayar.moistureKontrolBitisSaat = MOISTURE_KONTROL_BITIS_SAAT_VARSAYILAN;
  ayar.moistureKontrolBitisDakika = MOISTURE_KONTROL_BITIS_DAKIKA_VARSAYILAN;
  ayarlariKaydet();
  server.send(200, "application/json", "{\"basarili\":true,\"mesaj\":\"Nem ayarlari fabrika degerlerine sifirlandi\"}");
}
void handleSaveSettings() {
  if (server.hasArg("bosMesafe")) ayar.bosMesafe = server.arg("bosMesafe").toFloat();
  if (server.hasArg("doluMesafe")) ayar.doluMesafe = server.arg("doluMesafe").toFloat();
  if (server.hasArg("kapasite")) ayar.depoKapasiteLitre = server.arg("kapasite").toFloat();
  if (server.hasArg("alarmYuzde")) ayar.alarmSeviyeYuzde = server.arg("alarmYuzde").toFloat();
  if (server.hasArg("geceBaslangic")) ayar.geceBaslangicSaat = server.arg("geceBaslangic").toInt();
  if (server.hasArg("geceBitis")) ayar.geceBitisSaat = server.arg("geceBitis").toInt();
  if (server.hasArg("minDolumLitre")) ayar.minDolumLitre = server.arg("minDolumLitre").toFloat();
  if (server.hasArg("kacakEsikDakika")) ayar.kacakEsikDakika = server.arg("kacakEsikDakika").toInt();
  if (server.hasArg("depoYatay")) ayar.depoYatay = server.arg("depoYatay").toInt();
  if (server.hasArg("moistureAutomatic")) ayar.moistureAutomatic = server.arg("moistureAutomatic").toInt() ? 1 : 0;
  if (server.hasArg("moistureThresholdLow")) {
    int v = server.arg("moistureThresholdLow").toInt(); if (v < 0) v = 0; if (v > 100) v = 100; ayar.moistureThresholdLow = v;
  }
  if (server.hasArg("moistureThresholdHigh")) {
    int v = server.arg("moistureThresholdHigh").toInt(); if (v < 0) v = 0; if (v > 100) v = 100; ayar.moistureThresholdHigh = v;
  }
  if (server.hasArg("triggerGunduz")) ayar.alarmTriggerGunduz = server.arg("triggerGunduz").toInt();
  if (server.hasArg("triggerGece")) ayar.alarmTriggerGece = server.arg("triggerGece").toInt();
  if (server.hasArg("alarmMod")) {
    int m = server.arg("alarmMod").toInt();
    if (m >= 1 && m <= 3) { ayar.alarmMod = m; alarmOnayBekliyor = false; alarmOnaylandi = false; alarmOnaySadeceLamba = false; alarmSusturuldu = false; }
  }
  if (server.hasArg("alarmSensorEtkin")) ayar.alarmSensorEtkin = server.arg("alarmSensorEtkin").toInt();
  if (server.hasArg("alarmMaskSesli")) ayar.alarmMaskSesli = server.arg("alarmMaskSesli").toInt();
  if (server.hasArg("alarmMaskSessiz")) ayar.alarmMaskSessiz = server.arg("alarmMaskSessiz").toInt();
  if (server.hasArg("alarmMaskOnayli")) ayar.alarmMaskOnayli = server.arg("alarmMaskOnayli").toInt();
  if (server.hasArg("alarmOutputSesli")) ayar.alarmOutputSesli = server.arg("alarmOutputSesli").toInt();
  if (server.hasArg("alarmOutputSessiz")) ayar.alarmOutputSessiz = server.arg("alarmOutputSessiz").toInt();
  if (server.hasArg("pirPencereSaniye")) {
    int v = server.arg("pirPencereSaniye").toInt(); if (v < 0) v = 0; if (v > 120) v = 120; ayar.pirPencereSaniye = v;
  }
  if (server.hasArg("pirMinTetiklenme")) {
    int v = server.arg("pirMinTetiklenme").toInt(); if (v < 1) v = 1; if (v > PIR_DARBE_GECMISI_BOYUTU) v = PIR_DARBE_GECMISI_BOYUTU; ayar.pirMinTetiklenme = v;
  }
  if (server.hasArg("sirenGecikmeSaniye")) { int v = server.arg("sirenGecikmeSaniye").toInt(); if (v < 0) v = 0; if (v > 120) v = 120; ayar.sirenGecikmeSaniye = v; }
  if (server.hasArg("sirenChirpMs")) { int v = server.arg("sirenChirpMs").toInt(); if (v < 50) v = 50; if (v > 5000) v = 5000; ayar.sirenChirpMs = v; }
  if (server.hasArg("sirenBeklemeSaniye")) { int v = server.arg("sirenBeklemeSaniye").toInt(); if (v < 1) v = 1; if (v > 120) v = 120; ayar.sirenBeklemeSaniye = v; }
  if (server.hasArg("sirenAktifSaniye")) { int v = server.arg("sirenAktifSaniye").toInt(); if (v < 1) v = 1; if (v > 120) v = 120; ayar.sirenAktifSaniye = v; }
  if (server.hasArg("sirenMaxDakika")) { int v = server.arg("sirenMaxDakika").toInt(); if (v < 1) v = 1; if (v > 30) v = 30; ayar.sirenMaxDakika = v; }
  if (server.hasArg("moistureKontrolGunMask")) { int v = server.arg("moistureKontrolGunMask").toInt(); if (v < 0) v = 0; if (v > 0x7F) v = 0x7F; ayar.moistureKontrolGunMask = v; }
  if (server.hasArg("moistureKontrolBaslangicSaat")) { int v = server.arg("moistureKontrolBaslangicSaat").toInt(); if (v < 0) v = 0; if (v > 23) v = 23; ayar.moistureKontrolBaslangicSaat = v; }
  if (server.hasArg("moistureKontrolBaslangicDakika")) { int v = server.arg("moistureKontrolBaslangicDakika").toInt(); if (v < 0) v = 0; if (v > 59) v = 59; ayar.moistureKontrolBaslangicDakika = v; }
  if (server.hasArg("moistureKontrolBitisSaat")) { int v = server.arg("moistureKontrolBitisSaat").toInt(); if (v < 0) v = 0; if (v > 23) v = 23; ayar.moistureKontrolBitisSaat = v; }
  if (server.hasArg("moistureKontrolBitisDakika")) { int v = server.arg("moistureKontrolBitisDakika").toInt(); if (v < 0) v = 0; if (v > 59) v = 59; ayar.moistureKontrolBitisDakika = v; }
  if (server.hasArg("bahceAkim1SifirRaw")) { int v = server.arg("bahceAkim1SifirRaw").toInt(); if (v < 0) v = 0; if (v > 1023) v = 1023; ayar.bahceAkim1SifirRaw = v; }
  if (server.hasArg("bahceAkim2SifirRaw")) { int v = server.arg("bahceAkim2SifirRaw").toInt(); if (v < 0) v = 0; if (v > 1023) v = 1023; ayar.bahceAkim2SifirRaw = v; }
  if (server.hasArg("bahceAkim1EsikA")) { float v = server.arg("bahceAkim1EsikA").toFloat(); if (v < 0.1) v = 0.1; if (v > 20) v = 20; ayar.bahceAkim1EsikA = v; }
  if (server.hasArg("bahceAkim2EsikA")) { float v = server.arg("bahceAkim2EsikA").toFloat(); if (v < 0.1) v = 0.1; if (v > 20) v = 20; ayar.bahceAkim2EsikA = v; }
  ayarlariKaydet(); olcumYap();
  server.send(200, "application/json", "{\"mesaj\":\"Ayarlar kaydedildi\",\"basarili\":true}");
}

