Nedu41/SuDepoSis_v2/esp8266_slave/src/main.cpp
void handleKayitListesi() {
  KayitOzeti o; kayitOzet(o);
  String j = "{\"kayitlar\":" + kayitlariOkuJSON(100) + ",\"ozet\":{\"toplamLitre\":" + String(o.toplamLitre,1) + ",\"toplamUcret\":" + String(o.toplamUcret,2) + ",\"ayLitre\":" + String(o.ayLitre,1) + ",\"ayUcret\":" + String(o.ayUcret,2) + ",\"ayYagmur\":" + String(o.ayYagmur,1) + ",\"aySebeke\":" + String(o.aySebeke,1) + ",\"ayTanker\":" + String(o.ayTanker,1) + ",\"kayitSayisi\":" + String(o.kayitSayisi) + ",\"belirsizSayisi\":" + String(o.belirsizSayisi) + "}}";
  server.send(200, "application/json", j);
}
void handleKayitEkle() {
  if (!server.hasArg("litre") || !server.hasArg("tarih")) { server.send(400, "application/json", "{\"basarili\":false,\"mesaj\":\"Eksik\"}"); return; }
  String t = server.arg("tarih"), k = server.hasArg("kisi")?server.arg("kisi"):"-", y = server.hasArg("kaynak")?server.arg("kaynak"):"Sebeke";
  float l = server.arg("litre").toFloat(), u = server.hasArg("ucret")?server.arg("ucret").toFloat():0;
  if (l <= 0) { server.send(400, "application/json", "{\"basarili\":false,\"mesaj\":\"Litre hata\"}"); return; }
  server.send(200, "application/json", kayitEkle(t,k,l,u,y) ? "{\"basarili\":true,\"mesaj\":\"OK\"}" : "{\"basarili\":false,\"mesaj\":\"Hata\"}");
}
void handleKayitGuncelle() {
  if (!server.hasArg("index")) { server.send(400, "application/json", "{\"basarili\":false,\"mesaj\":\"index eksik\"}"); return; }
  int idx = server.arg("index").toInt();
  String t = server.hasArg("tarih")?server.arg("tarih"):simdikiTarihISO(), k = server.hasArg("kisi")?server.arg("kisi"):"-", y = server.hasArg("kaynak")?server.arg("kaynak"):"Belirsiz";
  float l = server.hasArg("litre")?server.arg("litre").toFloat():0, u = server.hasArg("ucret")?server.arg("ucret").toFloat():0;
  server.send(200, "application/json", kayitGuncelle(idx,t,k,l,u,y) ? "{\"basarili\":true,\"mesaj\":\"OK\"}" : "{\"basarili\":false,\"mesaj\":\"Bulunamadi\"}");
}
void handleKayitSil() {
  if (!server.hasArg("index")) { server.send(400, "application/json", "{\"basarili\":false,\"mesaj\":\"index eksik\"}"); return; }
  server.send(200, "application/json", kayitSil(server.arg("index").toInt()) ? "{\"basarili\":true,\"mesaj\":\"OK\"}" : "{\"basarili\":false,\"mesaj\":\"Bulunamadi\"}");
}
void handleKayitCSV() {
  File f = LittleFS.open(KAYIT_DOSYASI, "r");
  if (!f) { server.send(404, "text/plain", "Yok"); return; }
  server.sendHeader("Content-Disposition", "attachment; filename=kayitlar.csv");
  server.streamFile(f, "text/csv"); f.close();
}
void handleKayitTemizle() {
  if (server.arg("onay") != "evet") { server.send(400, "application/json", "{\"basarili\":false,\"mesaj\":\"Onay\"}"); return; }
  LittleFS.remove(KAYIT_DOSYASI); File f = LittleFS.open(KAYIT_DOSYASI, "w"); if (f) f.close();
  server.send(200, "application/json", "{\"basarili\":true,\"mesaj\":\"Tumunu silindi\"}");
}
void handleRoleAyarla() {
  if (!server.hasArg("aktif")) { server.send(400, "application/json", "{\"basarili\":false,\"mesaj\":\"param eksik\"}"); return; }
  ayar.alarmRoleAktif = server.arg("aktif").toInt()?1:0; ayarlariKaydet();
  server.send(200, "application/json", "{\"basarili\":true,\"mesaj\":\"" + String(ayar.alarmRoleAktif?"Aktif":"Pasif") + "\"}");
}
void handleRolePanic() {
  // FIX (kullanici sikayeti, 2026-08-31 - "kapata basiyorum ama kapanmiyor,
  // 3-4 denemede kapandi"): eskiden KOSULSUZ TOGGLE'di - istek network
  // gecikmesi/kaybi yuzunden sessizce basarisiz olursa (kullanici fark etmez,
  // tekrar tiklar) cift sayida gercek varis YANLIS yone donduruyordu. ESP32
  // tarafinda panikTetikleHedef()/alarmSustur() icin AYNI bug daha once
  // duzeltilmisti (bkz o dosyalardaki yorumlar) - burada da HEDEF acikca
  // "aktif" parametresiyle alinir, kac kere tekrar gonderilirse gonderilsin
  // sonuc ayni (idempotent). Parametre verilmezse (eski istemci) toggle'a
  // geri duser.
  bool hedef = server.hasArg("aktif") ? (server.arg("aktif").toInt() != 0) : !panicRoleAktif;
  panicRoleAktif = hedef;
  if (!panicRoleAktif) { sirenEpisodeBaslangicMs = 0; sirenFaz = 0; sirenFazBaslangicMs = 0; alarmSusturuldu = false; }
  bool ok = nanoRoleKontrol(panicRoleAktif);
  // FIX (kullanici sikayeti, 2026-08-27 - "banner butonlarda gecikme var"):
  // eskiden burada ssePush() cagrilmiyordu, degisiklik ancak periyodik 4sn'lik
  // otomatik push'ta veya tikleyen istemcinin kendi sonraki /olc cagrisinin
  // YAN ETKISIYLE baska istemcilere yansiyordu - baska bir sekme/telefon
  // acikken buyuk gecikme gibi hissediliyordu. Artik aninda push ediliyor.
  ssePush();
  server.send(200, "application/json", "{\"basarili\":" + String(ok?"true":"false") + ",\"mesaj\":\"" + String(panicRoleAktif?"Panik Acik":"Panik Kapali") + "\",\"panic\":" + String(panicRoleAktif?"true":"false") + "}");
}
void handleRolePolarite() {
  if (!server.hasArg("aktif")) { server.send(400, "application/json", "{\"basarili\":false,\"mesaj\":\"param eksik\"}"); return; }
  bool aktifHigh = server.arg("aktif").toInt() != 0;
  nanoRolePolariteKontrol(aktifHigh);
  server.send(200, "application/json", "{\"basarili\":true,\"mesaj\":\"Polarite: " + String(aktifHigh ? "HIGH=Aktif" : "LOW=Aktif") + "\"}");
}
void handleAlarmSustur() {
  // Susturma = "sireni kapat": tetikleyici hala aktif olsa da rölenin
  // sese/tetiklenmeye devam etmesini durdurur. Yeni bir tetikleyici
  // (durum degisikligi) gelene kadar susturulmus kalir.
  alarmSusturuldu = !alarmSusturuldu;
  ssePush(); // bkz handleRolePanic yorumu - aninda push
  server.send(200, "application/json", "{\"basarili\":true,\"susturuldu\":" + String(alarmSusturuldu ? "true" : "false") + "}");
}
void handleAlarmOnayla() {
  // Mod 3 (Onayli): kullanici tetiklenmeyi onaylar, siren sesli mod gibi calismaya baslar.
  alarmOnaylandi = true; alarmOnayBekliyor = false; alarmOnaySadeceLamba = false;
  ssePush(); // bkz handleRolePanic yorumu - aninda push
  server.send(200, "application/json", "{\"basarili\":true,\"mesaj\":\"Onaylandi\"}");
}
void handleAlarmOnaylaLamba() {
  // Mod 3 (Onayli): kullanici sadece lamba flasoru ister - siren/role calismaz.
  alarmOnaySadeceLamba = true; alarmOnayBekliyor = false; alarmOnaylandi = false;
  ssePush(); // bkz handleRolePanic yorumu - aninda push
  server.send(200, "application/json", "{\"basarili\":true,\"mesaj\":\"Sadece lamba flasoru aktif\"}");
}
String jsonKacir(const String& s) {
  String out = s;
  out.replace("\\", "\\\\");
  out.replace("\"", "\\\"");
  return out;
}
void handleAlarmLog() {
  String j = "[";
  for (uint8_t i = 0; i < alarmLogRAMDolu; i++) {
    if (i) j += ",";
    j += "{\"zaman\":\"" + jsonKacir(alarmLogRAM[i].zaman) + "\",\"baslik\":\"" + jsonKacir(alarmLogRAM[i].baslik) + "\",\"tetikleyen\":\"" + jsonKacir(alarmLogRAM[i].tetikleyen) + "\"}";
  }
  j += "]";
  server.send(200, "application/json", j);
}
// ESP32 Merkez Kontrol panelindeki handleAPI_AlarmLogTam ile AYNI mantik -
// "tetikleyen" alani virgul icerebildigi icin sadece ILK IKI virgule kadar bolunur.
void handleAlarmLogTam() {
  String j = "[";
  bool ilk = true;
  if (LittleFS.exists(ALARM_LOG_DOSYASI)) {
    File f = LittleFS.open(ALARM_LOG_DOSYASI, "r");
    if (f) {
      while (f.available()) {
        String satir = f.readStringUntil('\n');
        satir.trim();
        if (satir.length() == 0) continue;
        int v1 = satir.indexOf(',');
        int v2 = (v1 >= 0) ? satir.indexOf(',', v1 + 1) : -1;
        if (v1 < 0 || v2 < 0) continue;
        if (!ilk) j += ",";
        ilk = false;
        j += "{\"zaman\":\"" + jsonKacir(satir.substring(0, v1)) + "\",\"baslik\":\"" + jsonKacir(satir.substring(v1 + 1, v2)) + "\",\"tetikleyen\":\"" + jsonKacir(satir.substring(v2 + 1)) + "\"}";
      }
      f.close();
    }
  }
  j += "]";
  server.send(200, "application/json", j);
}
void handleWifiDurum() {
  bool b = (WiFi.status() == WL_CONNECTED);
  server.send(200, "application/json", "{\"tanimli\":" + String(strlen(wifiAyar.ssid)>0?"true":"false") + ",\"ssid\":\"" + String(wifiAyar.ssid) + "\",\"bagli\":" + String(b?"true":"false") + ",\"ip\":\"" + (b?WiFi.localIP().toString():"-") + "\",\"sifreVar\":" + String(strlen(wifiAyar.sifre)>0?"true":"false") + "}");
}
// Kayitli WiFi gecmisini listeler - SADECE SSID doner, sifreler cihazda
// kalir (istemciye asla gonderilmez, "gecmis_bagla" sunucu tarafinda
// kendi sakladigi sifreyi kullanir).
void handleWifiGecmisListe() {
  String j = "[";
  bool ilk = true;
  for (int i = 0; i < WIFI_GECMIS_SAYISI; i++) {
    if (strlen(wifiAyar.gecmis[i].ssid) == 0) continue;
    if (!ilk) j += ",";
    ilk = false;
    j += "{\"idx\":" + String(i) + ",\"ssid\":\"" + jsonKacir(String(wifiAyar.gecmis[i].ssid)) + "\"}";
  }
  j += "]";
  server.send(200, "application/json", j);
}
void handleWifiGecmisBagla() {
  if (!server.hasArg("idx")) { server.send(400, "application/json", "{\"basarili\":false,\"mesaj\":\"idx eksik\"}"); return; }
  int idx = server.arg("idx").toInt();
  if (!wifiGecmisiAktifYap(idx)) { server.send(400, "application/json", "{\"basarili\":false,\"mesaj\":\"Kayit bulunamadi\"}"); return; }
  // handleWifiKaydet'teki restart FIX ile AYNI gerekce - canli ag degistirme
  // yerine temiz bir yeniden baslatma.
  server.send(200, "application/json", "{\"basarili\":true,\"mesaj\":\"" + String(wifiAyar.ssid) + " agina baglanmak icin yeniden baslatiliyor\"}");
  server.client().flush();
  delay(500);
  ESP.restart();
}
void handleWifiGecmisSil() {
  if (!server.hasArg("idx")) { server.send(400, "application/json", "{\"basarili\":false,\"mesaj\":\"idx eksik\"}"); return; }
  wifiGecmisiSil(server.arg("idx").toInt());
  server.send(200, "application/json", "{\"basarili\":true,\"mesaj\":\"Silindi\"}");
}
void handleWifiKaydet() {
  String ssid = "";
  String pw = "";
  // Accept either long names (ssid/sifre) or short names (s/p) from the JS/UI
  if (server.hasArg("ssid")) ssid = server.arg("ssid");
  else if (server.hasArg("s")) ssid = server.arg("s");
  if (server.hasArg("sifre")) pw = server.arg("sifre");
  else if (server.hasArg("p")) pw = server.arg("p");

  // If no SSID provided at all, reject the request
  if (!server.hasArg("ssid") && !server.hasArg("s")) { server.send(400, "application/json", "{\"basarili\":false,\"mesaj\":\"ssid eksik\"}"); return; }

