Nedu41/SuDepoSis_v2/esp8266_slave/src/main.cpp
  // Empty SSID => remove saved WiFi (2026-09-08: gecmise ekleyerek kaldir -
  // "bagli oldugum aglar hafizada kalsin" istegi, tamamen kaybolmasin)
  if (ssid.length() == 0) {
    wifiGecmiseEkle(wifiAyar.ssid, wifiAyar.sifre);
    wifiAyar.ssid[0]='\0'; wifiAyar.sifre[0]='\0'; wifiAyarlariKaydet(); WiFi.disconnect();
    server.send(200, "application/json", "{\"basarili\":true,\"mesaj\":\"Kaldirildi\"}");
    return;
  }

  // Farkli bir aga geciliyorsa eski aktif ag gecmise eklenir (kaybolmasin)
  if (strcmp(wifiAyar.ssid, ssid.c_str()) != 0) wifiGecmiseEkle(wifiAyar.ssid, wifiAyar.sifre);
  ssid.toCharArray(wifiAyar.ssid, 32);
  // FIX: Sifre bos birakildiysa eski kayitli sifre korunur (silinmez).
  // Ayrica bozuk DEBUG_PRINTF satiri duzeltildi.
  if (pw.length() > 0) {
    pw.toCharArray(wifiAyar.sifre, 32);
  }
  wifiAyarlariKaydet();
  DEBUG_PRINTF("[WIFI] Kaydedilen SSID: %s, sifreVar=%d\n", wifiAyar.ssid, strlen(wifiAyar.sifre) > 0);
  // FIX (kullanici sikayeti, 2026-09-08: "baglan-kaydet dedigimde durum
  // yazilari refresh olmuyor, ancak reset atinca degisiyor"): STA zaten
  // baska bir aga baglanmisken WiFi.disconnect()+WiFi.begin() ile CANLI
  // ag degistirmek ESP8266 WiFi surucusunde bilinen bir sorun - radyo bazen
  // duzgun yeniden iliskilenmiyor, sadece temiz bir ESP.restart() sonrasi
  // yeni SSID'ye gercekten baglaniyor (bkz handleRestart yorumu, ayni
  // gecikme/flush deseni). Kayittan hemen sonra kendini yeniden baslatir.
  server.send(200, "application/json", "{\"basarili\":true,\"mesaj\":\"Kaydedildi, yeniden baslatiliyor\"}");
  server.client().flush();
  delay(500);
  ESP.restart();
}

void handleWifiScan() {
  delay(100); // give radio a moment
  DEBUG_PRINTLN("[WIFI] Scan basliyor...");
  int n = WiFi.scanNetworks();
  DEBUG_PRINTF("[WIFI] Bulunan ag sayisi: %d\n", n);
  String j = "[";
  for (int i = 0; i < n; i++) {
    if (i) j += ",";
    String ss = WiFi.SSID(i);
    int r = WiFi.RSSI(i);
    bool sec = (WiFi.encryptionType(i) != ENC_TYPE_NONE);
    DEBUG_PRINTF("[WIFI] %d: %s (%d dBm) secured=%d\n", i, ss.c_str(), r, sec);
    // FIX: Tirnak/backslash iceren SSID'ler JSON'u bozuyordu
    ss.replace("\\", "\\\\");
    ss.replace("\"", "\\\"");
    j += "{\"ssid\":\"" + ss + "\",\"rssi\":" + String(r) + ",\"secured\":" + String(sec ? "true" : "false") + "}";
  }
  j += "]";
  server.send(200, "application/json", j);
}

// https://host[:port]/path formatindan host/port ayiklar (probeMaxFragmentLength icin).
static bool parseHttpsHost(const String& url, String& host, uint16_t& port) {
  if (!url.startsWith("https://")) return false;
  int hostStart = 8; // strlen("https://")
  int pathStart = url.indexOf('/', hostStart);
  String hostPort = (pathStart == -1) ? url.substring(hostStart) : url.substring(hostStart, pathStart);
  int colon = hostPort.indexOf(':');
  if (colon == -1) { host = hostPort; port = 443; }
  else { host = hostPort.substring(0, colon); port = (uint16_t)hostPort.substring(colon + 1).toInt(); }
  return host.length() > 0;
}

// ============ JS ENDPOINT ============
// FIX: Eskiden yanit indirme/yazma BASLAMADAN ONCE "Guncelleniyor" diye
// gonderiliyordu - basarili da olsa (kutuphane ESP.restart() ile yanit asla
// gonderilemeden yeniden baslatiyordu) basarisiz da olsa (hata sadece
// Serial'e yaziliyordu) buton metni sonsuza kadar "Guncelleniyor" yazili
// kaliyordu. Simdi rebootOnUpdate(false) ile otomatik restart kapatilip
// yanit GERCEK sonucla gonderiliyor, restart ondan SONRA yapiliyor.
void performOTA(const String& url) {
  ESPhttpUpdate.rebootOnUpdate(false);
  t_httpUpdate_return ret;
  if (url.startsWith("https://")) {
    // https:// (orn. raw.githubusercontent.com) icin BearSSL gerekir - sertifika
    // zincirini dogrulamadan kabul eder (ESP8266'da tam zincir dogrulama pahali).
    BearSSL::WiFiClientSecure client;
    client.setInsecure();
    client.setTimeout(15000);
    // FIX: BearSSL'in varsayilan TLS tampon boyutlari (~16KB+) ESP8266'nin
    // ~80KB RAM'inde (WebServer/LittleFS/RS485/EEPROM zaten kullanimda)
    // ayrilamiyordu - ("connection failed"). Once sabit 512 bayta
    // zorlandi, ama bu da YANLIS: sunucu o boyutu gercekte kabul etmeyip
    // daha buyuk bir kayit gonderdiginde BearSSL'in tampona sigdiramayip
    // baglantiyi ortadan kesmesine yol acti ("connection lost"). Dogrusu:
    // once probeMaxFragmentLength ile sunucunun GERCEKTEN destekledigi en
    // kucuk boyutu sormak, sadece o boyutu kullanmak - sunucu desteklemezse
    // varsayilan (buyuk) tampona geri donulur.
    String host; uint16_t port;
    if (parseHttpsHost(url, host, port)) {
      int mfln = client.probeMaxFragmentLength(host.c_str(), port, 512);
      DEBUG_PRINTF("[OTA] probeMaxFragmentLength(%s:%u) = %d (heap once: %u)\n", host.c_str(), port, mfln, ESP.getFreeHeap());
      if (mfln > 0) client.setBufferSizes(mfln, mfln);
    }
    ret = ESPhttpUpdate.update(client, url);
    if (ret != HTTP_UPDATE_OK) {
      char sslErr[128];
      int sslCode = client.getLastSSLError(sslErr, sizeof(sslErr));
      DEBUG_PRINTF("[OTA] BearSSL son hata: kod=%d mesaj=%s\n", sslCode, sslErr);
    }
  } else {
    WiFiClient client;
    ret = ESPhttpUpdate.update(client, url);
  }

  String mesaj;
  bool basarili = (ret == HTTP_UPDATE_OK);
  if (basarili) {
    mesaj = "Basarili - yeniden baslatiliyor";
  } else if (ret == HTTP_UPDATE_NO_UPDATES) {
    mesaj = "Guncelleme yok";
  } else {
    // Teshis icin: "connection failed" hem dusuk heap (BearSSL) hem de STA'nin
    // gercekte internete cikamamasi (sadece yerel ag/AP) yuzunden olabilir -
    // ikisini ayirt etmek icin heap + WiFi durumu hataya ekleniyor.
    mesaj = "Hata: " + ESPhttpUpdate.getLastErrorString() +
            " [heap:" + String(ESP.getFreeHeap()) +
            " wifi:" + (WiFi.isConnected() ? (WiFi.SSID() + "/" + WiFi.localIP().toString()) : "baglanti-yok") + "]";
  }
  // FIX: /ota?url=X her tiklamada AYNI URL ile GET istegi - tarayici
  // Cache-Control gonderilmezse bunu onbellekleyip cihaza hic gitmeden eski
  // yaniti (orn. eski firmware'den kalma "Guncelleniyor: X" metnini) tekrar
  // tekrar gosterebiliyordu.
  server.sendHeader("Cache-Control", "no-cache, no-store, must-revalidate");
  server.sendHeader("Pragma", "no-cache");
  server.send(200, "application/json", "{\"basarili\":" + String(basarili ? "true" : "false") + ",\"mesaj\":\"" + mesaj + "\"}");
  // FIX (kullanici sikayeti, 2026-08-27, bkz handleRestart yorumu): 200ms
  // gecikme de yetersiz kalabiliyordu - yanit tarayiciya tam ulasmadan
  // ESP.restart() baglantiyi kesiyor, buton sonsuza kadar "Guncelleniyor..."
  // yazili kaliyordu (basarili=false/hata durumunda BU SORUN YOK - orada
  // restart hic cagrilmiyor, yaniti okuyup gosteren normal fetch akisi calisiyor).
  if (basarili) { server.client().flush(); delay(500); ESP.restart(); }
}

void handleOTAUpdate() {
  if (!server.hasArg("url")) { server.send(400, "application/json", "{\"basarili\":false,\"mesaj\":\"URL eksik\"}"); return; }
  performOTA(server.arg("url"));
}

