Nedu41/SuDepoSis_v2/esp8266_slave/src/main.cpp
// ============ LOOP ============
void loop() {
  ArduinoOTA.handle(); server.handleClient();

  // AP her zaman acik olmali (STA baglantisindan bagimsiz). Nadiren heap
  // parcalanmasi/RF sorunu ile AP dusebiliyor - periyodik kontrol edip
  // gerekirse yeniden baslatiyoruz.
  static unsigned long sonApKontrolMs = 0;
  unsigned long simdiMs = millis();
  if (simdiMs - sonApKontrolMs >= 30000UL) {
    sonApKontrolMs = simdiMs;
    if (!(WiFi.getMode() & WIFI_AP)) {
      DEBUG_PRINTLN("[WIFI] AP kapaliydi, yeniden baslatiliyor");
      WiFi.mode(WIFI_AP_STA);
      WiFi.softAP(WIFI_AP_SSID, WIFI_AP_PASSWORD, WIFI_AP_CHANNEL, WIFI_AP_HIDDEN);
    }
  }

  // RTC bagliliğini periyodik yeniden dene. Sadece setup()'ta bir kez
  // denenirse, boot anindaki gecici bir I2C hazirsizlik/gecikme sorunu
  // rtcHazir'i kalici olarak false'ta biraktiriyordu - sonraki reboot'a
  // kadar hicbir zaman duzelmiyordu ("bazen calisiyor bazen calismiyor"
  // davranisinin sebebi buydu). Simdi 30sn'de bir tekrar denenir.
  static unsigned long sonRtcDenemeMs = 0;
  if (!rtcHazir && simdiMs - sonRtcDenemeMs >= 30000UL) {
    sonRtcDenemeMs = simdiMs;
    Wire.begin(RTC_SDA, RTC_SCL);
    if (rtc.begin()) {
      rtcHazir = true;
      DEBUG_PRINTLN("[RTC] Yeniden baglanildi");
    }
  }

  // FIX: WiFi koparsa mDNS'i yeniden baslat (STA modu icin)
  if (strlen(wifiAyar.ssid) > 0) {
    if (WiFi.status() == WL_CONNECTED && !mdnsAktif) {
      String host = mdnsHostname();
      if (MDNS.begin(host.c_str())) {
        MDNS.addService("http", "tcp", 80);
        mdnsAktif = true;
        DEBUG_PRINTF("[mDNS] Yeniden baslatildi: %s.local\n", host.c_str());
      }
    } else if (WiFi.status() != WL_CONNECTED) {
      mdnsAktif = false;
    }
  }

  MDNS.update();
  nanoPoll();
  server.handleClient();  // FIX: Bloklayıcı nanoPoll sonrası web isteklerini işle
  kapiPoll();  // Bahce kapisi hareket halindeyse limit switch/akim kontrolu (bloklayici, sadece hareket sirasinda)
  zilButonPoll();  // Kapi zili butonu - basilinca Nano buzzer'inda ding-dong calar
  ntpOtomatikPoll();  // WiFi STA varsa RTC'yi saatte bir arka planda internetten tazeler (non-blocking)
  server.handleClient();
  rs485KomutDinle();
  server.handleClient();  // FIX: RS485 dinleme sonrası web isteklerini işle
  // ALARM KONTROLÜ - nanoMesgul kontrolü blink'i önler (komut beklerken yeni gönderme)
  if (!nanoMesgul) {
    // PANIK MODU - toggle, sürekli komut gönderme (her seyin onunde, mod/susturma etkilemez)
    if (panicRoleAktif) {
      alarmTetikleyenMask = 0; // panikte sensor tetikleyicisi yok, elle acildi
      alarmCikisLambaIstenen = true; // panikte her zaman hem siren hem lamba
      lambaSurekliBaslangicMs = 0; // lamba icin MAX-sure sayaci panikte HER dongude sifirlanir (Konteyner/ESP32'deki konteynerAcilDurum ile ayni mantik) - lamba panikte kendiliginden SONMEZ
      // BUG DUZELTMESI (kullanici bulgusu, 2026-09-04: "panikte de Kalburum/
      // Konteyner gibi chirp calsin, surekli acik kalmasin"): eskiden burada
      // sirenEpisodeBaslangicMs/sirenFaz HER dongude sifirlaniyordu - bu da
      // asagidaki FSM'nin faz 0'dan (ilk gecikme) hic ilerleyememesine, role'un
      // ilk acildigi haliyle SURESIZ acik kalmasina sebep oluyordu. Artik
      // Konteyner/ESP32'deki ile BIREBIR ayni chirp FSM'i kullaniyor (bkz
      // asagidaki normal tetikleyici dalindaki AYNI kod), mod/mask'ten
      // BAGIMSIZ ama azami-sure kuralina normal tetikleyiciyle AYNI sekilde
      // uyar (kullanici talebi, 2026-09-04: "paniktede max sureye uyulsun,
      // sonra kapansin") - asagida ayar.sirenMaxDakika asilinca alarmSusturuldu
      // ile siren susturulur, panicRoleAktif (panik DURUMU) degismeden kalir,
      // sadece butona tekrar basilinca (PANIC=0) tamamen kapanir.
      unsigned long simdiMs = millis();
      if (sirenEpisodeBaslangicMs == 0) {
        sirenEpisodeBaslangicMs = simdiMs;
        sirenFaz = 0;
        sirenFazBaslangicMs = simdiMs;
      }
      unsigned long gecikmeMs = (unsigned long)ayar.sirenGecikmeSaniye * 1000UL;
      unsigned long chirpMs = (unsigned long)ayar.sirenChirpMs;
      unsigned long beklemeMs = (unsigned long)ayar.sirenBeklemeSaniye * 1000UL;
      bool sirenIstenen;
      switch (sirenFaz) {
        case 0: // ilk gecikme - sessiz
          sirenIstenen = false;
          if (simdiMs - sirenFazBaslangicMs >= gecikmeMs) { sirenFaz = 1; sirenFazBaslangicMs = simdiMs; }
          break;
        case 1: // atis - acik
          sirenIstenen = true;
          if (simdiMs - sirenFazBaslangicMs >= chirpMs) { sirenFaz = 2; sirenFazBaslangicMs = simdiMs; }
          break;
        default: // 2: atislar arasi - kapali
          sirenIstenen = false;
          if (simdiMs - sirenFazBaslangicMs >= beklemeMs) { sirenFaz = 1; sirenFazBaslangicMs = simdiMs; }
          break;
      }
      sirenIstenen = sirenIstenen && !alarmSusturuldu;
      if (sirenEpisodeBaslangicMs != 0 && millis() - sirenEpisodeBaslangicMs > (unsigned long)ayar.sirenMaxDakika * 60000UL) {
        alarmSusturuldu = true;
        sirenIstenen = false;
      }
      if (sirenIstenen && !roleFizikselDurum) nanoRoleKontrol(true);
      else if (!sirenIstenen && roleFizikselDurum) nanoRoleKontrol(false);
    } else if (!ayar.alarmRoleAktif) {
      // Alarm sistemi kapali: hicbir tetikleyici sirene/roleye yansimamali
      alarmSusturuldu = false; alarmOnayBekliyor = false; alarmOnaylandi = false; alarmOnaySadeceLamba = false;
      alarmTetikleyenMask = 0;
      alarmCikisLambaIstenen = false;
      sirenEpisodeBaslangicMs = 0; sirenFaz = 0; sirenFazBaslangicMs = 0; lambaSurekliBaslangicMs = 0;
      if (roleFizikselDurum) nanoRoleKontrol(false);
    } else {
      // Zaman bazli (gunduz/gece) VE secili modun kendi senaryosu (hangi sensorler
      // bu modu tetikler) birlikte degerlendirilir.
      uint8_t zamanMask = geceModuMu() ? ayar.alarmTriggerGece : ayar.alarmTriggerGunduz;
      uint8_t modMask;
      switch (ayar.alarmMod) {
        case ALARM_MOD_SESSIZ: modMask = ayar.alarmMaskSessiz; break;
        case ALARM_MOD_ONAYLI: modMask = ayar.alarmMaskOnayli; break;
        default:                modMask = ayar.alarmMaskSesli; break;
      }
      // alarmSensorEtkin: mod/zamandan BAGIMSIZ genel ac/kapa - kablosuz/arizali
      // bir sensoru buradan tamamen devre disi birakmak icin (kullanici talebi,
      // Konteyner Zonu'ndaki sensor anahtarlariyla ayni mantik).
      uint8_t mask = zamanMask & modMask & ayar.alarmSensorEtkin;
      bool triggerActive = false;
      uint8_t tetikleyenMask = 0;
      // Bahce kapisi motorla kontrol edilirken (acik/aciliyor/kilit aciliyor/
      // kapaniyor/hata) bu sensor ayni zamanda "kapi acik" okur - bilerek
      // yapilan bir hareketi yanlis alarm/telegram bildirimine cevirmemek
      // icin bu durumda tetikleyici bypass edilir (bkz config.h BAHCE_* notu).
      if ((mask & ALARM_TRIGGER_KAPI1) && kapi1Acik && bahceKapi[0].durum == KAPI_KAPALI) { triggerActive = true; tetikleyenMask |= ALARM_TRIGGER_KAPI1; }
      if ((mask & ALARM_TRIGGER_KAPI2) && kapi2Acik && bahceKapi[1].durum == KAPI_KAPALI) { triggerActive = true; tetikleyenMask |= ALARM_TRIGGER_KAPI2; }
      if ((mask & ALARM_TRIGGER_PIR) && pirTetikleyici) { triggerActive = true; tetikleyenMask |= ALARM_TRIGGER_PIR; }
      if ((mask & ALARM_TRIGGER_SU_SEVIYE) && alarmAktif) { triggerActive = true; tetikleyenMask |= ALARM_TRIGGER_SU_SEVIYE; }
      if ((mask & ALARM_TRIGGER_KACAK) && kacakAlarmi) { triggerActive = true; tetikleyenMask |= ALARM_TRIGGER_KACAK; }
      if ((mask & ALARM_TRIGGER_SENSOR) && sensorHatasi) { triggerActive = true; tetikleyenMask |= ALARM_TRIGGER_SENSOR; }
      alarmTetikleyenMask = tetikleyenMask;
      // Sadece "bilgi amacli" tetikleyiciler (su seviyesi/sensor hatasi) mi
      // aktif? Asagida (a) Onayli modun onay-bekleme adimini atlamak icin,
      // (b) siren/lamba hedefini sifirlamak icin kullanilir.
      bool bilgiSadeceTetik = (tetikleyenMask != 0) && ((tetikleyenMask & ~(ALARM_TRIGGER_SU_SEVIYE | ALARM_TRIGGER_SENSOR)) == 0);

      bool lambaHedefHam = false; // bu turun ham lamba hedefi - MIN sure asagida uygulanir
      if (!triggerActive) {
        // Tetikleyici temizlendi - susturma/onay durumlari sifirlanir (bir sonraki
        // tetiklenmede modun varsayilan davranisi yeniden gecerli olsun)
        alarmSusturuldu = false; alarmOnayBekliyor = false; alarmOnaylandi = false; alarmOnaySadeceLamba = false;
        sirenEpisodeBaslangicMs = 0; sirenFaz = 0; sirenFazBaslangicMs = 0; lambaSurekliBaslangicMs = 0;
        if (roleFizikselDurum) nanoRoleKontrol(false);
      } else {
        bool sirenSeciliHam; // susturma/chirp'ten BAGIMSIZ, sadece mod/cikis secimine gore siren istenip istenmedigi
        // Sesli/Sessiz modda hangi cikislarin (siren/lamba) aktif olacagi artik
        // kullanicinin Alarm Ayarlari'ndaki "Mod Senaryolari" cikis secimlerinden
        // (ayar.alarmOutputSesli/Sessiz) geliyor - eskiden Sessiz mod icin siren
        // VE lamba sabit/hardcoded kapaliydi, "sadece bildirim" hic gorunmuyordu.
        if (ayar.alarmMod == ALARM_MOD_SESSIZ) {
          sirenSeciliHam = (ayar.alarmOutputSessiz & ALARM_OUTPUT_SIREN) != 0;
          lambaHedefHam = (ayar.alarmOutputSessiz & ALARM_OUTPUT_LAMBA) != 0;
        } else if (ayar.alarmMod == ALARM_MOD_ONAYLI) {
          if (bilgiSadeceTetik) {
            // Bilgi amacli tetikleyici (su seviyesi/sensor) Onayli modun onay-
            // bekleme adimini hic tetiklemesin - asagidaki genel istisna zaten
            // siren/lambayi kapatacak, burada sadece alarmOnayBekliyor'un
            // gereksiz yere true olmasini (ve RS485 uzerinden Konteyner'e
            // "onay bekliyor" olarak sizmasini) onluyoruz.
            sirenSeciliHam = false; lambaHedefHam = false;
          } else if (alarmOnaySadeceLamba) {
            sirenSeciliHam = false; lambaHedefHam = true; // sadece lamba flaşörü - siren/role calismaz
          } else if (!alarmOnaylandi) {
            alarmOnayBekliyor = true; sirenSeciliHam = false; lambaHedefHam = false;
          } else {
            // BUG (kullanici talebi): lamba onceden dogrudan sirenIstenen'i
            // (yani susturmayi) izliyordu - Sustur basilinca lamba da
            // sonuyordu. Simdi Sesli/Sessiz ile TUTARLI: susturma SADECE
            // sireni etkiler, lamba eskale surdukce yanmaya devam eder.
            sirenSeciliHam = true; lambaHedefHam = true;
          }
        } else {
          // Sesli mod
          sirenSeciliHam = (ayar.alarmOutputSesli & ALARM_OUTPUT_SIREN) != 0;
          lambaHedefHam = (ayar.alarmOutputSesli & ALARM_OUTPUT_LAMBA) != 0;
        }
        // Su seviyesi dusuk VE sensor hatasi (HC-SR04 bagli degil/okunamiyor)
        // guvenlik tehdidi degil (kullanici talebi, 2026-09-04: "esp8266
        // hc-sr04 bagli degil diye surekli alarm veriyor, bu tur uyarilar dis
        // sirene bagli olmasin") - siren/lamba TETIKLEMESIN, sadece banner/
        // mesaj olarak gorunsun (Telegram zaten ayrica gidiyor, bkz sensorHatasi
        // kullanildigi yerler). Ayni anda baska bir tetikleyici (kapi/PIR/kacak)
        // da aktifse o normal siren/lamba davranisini tetiklemeye devam eder.
        if (bilgiSadeceTetik) {
          sirenSeciliHam = false;
          lambaHedefHam = false;
        }
        // Tekrarlayan-atis deseni (2026-08-27, kullanici talebi: "Sudepo
        // siren prensibi de Kalburum'unkiyle ayni olsun") - Konteyner/ESP32
        // ile BIREBIR ayni mantik (bkz alarmLedGuncelle/konteynerAnimasyonluTetik
        // yorumu): eski "gecikme+chirp+bekleme+UZUN SUREKLI aktif" deseni
        // 2026-08-25'te Konteyner'de KALDIRILMISTI, Sudepo o guncellemeyi hic
        // almamisti. Simdi ayni: tetik baslangicindan ayar.sirenGecikmeSaniye
        // sonra, ayar.sirenChirpMs acik / ayar.sirenBeklemeSaniye kapali
        // seklinde KISA ATISLAR tetik bitene kadar SONSUZA TEKRARLANIR - ayrı
        // bir "uzun sureli surekli aktif" fazi YOK (eski sirenAktifSaniye
        // ayari artik kullanilmiyor, sadece EEPROM/API uyumlulugu icin
        // struct'ta duruyor).
        bool sirenIstenen;
        if (sirenSeciliHam) {
          unsigned long simdiMs = millis();
          if (sirenEpisodeBaslangicMs == 0) {
            sirenEpisodeBaslangicMs = simdiMs;
            sirenFaz = 0;
            sirenFazBaslangicMs = simdiMs;
          }
          unsigned long gecikmeMs = (unsigned long)ayar.sirenGecikmeSaniye * 1000UL;
          unsigned long chirpMs = (unsigned long)ayar.sirenChirpMs;
          unsigned long beklemeMs = (unsigned long)ayar.sirenBeklemeSaniye * 1000UL;
          switch (sirenFaz) {
            case 0: // ilk gecikme - sessiz
              sirenIstenen = false;
              if (simdiMs - sirenFazBaslangicMs >= gecikmeMs) { sirenFaz = 1; sirenFazBaslangicMs = simdiMs; }
              break;
            case 1: // atis - acik
              sirenIstenen = true;
              if (simdiMs - sirenFazBaslangicMs >= chirpMs) { sirenFaz = 2; sirenFazBaslangicMs = simdiMs; }
              break;
            default: // 2: atislar arasi - kapali
              sirenIstenen = false;
              if (simdiMs - sirenFazBaslangicMs >= beklemeMs) { sirenFaz = 1; sirenFazBaslangicMs = simdiMs; }
              break;
          }
        } else {
          sirenEpisodeBaslangicMs = 0;
          sirenFaz = 0; sirenFazBaslangicMs = 0;
          sirenIstenen = false;
        }
        sirenIstenen = sirenIstenen && !alarmSusturuldu;
        // Sensor arizasi/unutulmus tetiklenmede siren SINIRSIZ calmasin diye
        // EPIZOT BASLANGICINDAN itibaren gecen TOPLAM sure asarsa otomatik
        // susturulur. Panik bu BLOGA hic girmez (kendi ayri dalinda, yukarida)
        // ama panik dalinda da AYNI azami-sure kurali AYRICA uygulaniyor
        // (2026-09-04 kullanici talebi - panik de kendiliginden susar).
        // Kademeli zamanlama nedeniyle
        // sirenIstenen bekleme fazlarinda sik sik false oldugundan, olcum
        // "kesintisiz calma" yerine sirenEpisodeBaslangicMs referans alinarak
        // yapilir (aksi halde 2dk'ya asla ulasilamaz).
        if (sirenEpisodeBaslangicMs != 0 && millis() - sirenEpisodeBaslangicMs > (unsigned long)ayar.sirenMaxDakika * 60000UL) {
          alarmSusturuldu = true;
          sirenIstenen = false;
        }
        if (sirenIstenen && !roleFizikselDurum) nanoRoleKontrol(true);
        else if (!sirenIstenen && roleFizikselDurum) nanoRoleKontrol(false);
      }
      // Lamba MIN sure: Sustur basilsin ya da tetikleyici erken temizlensin,
      // lamba en az LAMBA_MIN_SURE_MS boyunca acik kalmaya devam eder
      // (kullanici talebi: "en az 60sn lambalar yansın").
      if (lambaHedefHam) {
        lambaMinSureBaslangicMs = millis();
        alarmCikisLambaIstenen = true;
      } else if (lambaMinSureBaslangicMs != 0 && millis() - lambaMinSureBaslangicMs < LAMBA_MIN_SURE_MS) {
        alarmCikisLambaIstenen = true;
      } else {
        lambaMinSureBaslangicMs = 0;
        alarmCikisLambaIstenen = false;
      }
      // Lamba MAX sure (kullanici talebi, enerji butcesi): alarm-tetikli
      // lamba kesintisiz LAMBA_MAX_SURE_MS'i (10dk) asarsa zorla soner -
      // siren'deki 2dk oto-sustur deseniyle simetrik. Manuel lamba acma
      // (lambaAcik/toggleLamba) ayri bir kod yolundan gittigi icin
      // alarmCikisLambaIstenen'e hic girmez, bu bloktan etkilenmez.
      if (alarmCikisLambaIstenen) {
        if (lambaSurekliBaslangicMs == 0) lambaSurekliBaslangicMs = millis();
        else if (millis() - lambaSurekliBaslangicMs > LAMBA_MAX_SURE_MS) alarmCikisLambaIstenen = false;
      } else {
        lambaSurekliBaslangicMs = 0;
      }
    }
  }
  // ============ BUZZER KURALLARI (kullanici talebi, 2026-08-27) ============
  // 1) Alarm sistemi ACIKKEN (ayar.alarmRoleAktif) PIR her YENI "bolum"
  //    basinda (pirAcik false->true) TEK kisa bip.
  // 2) Alarm sistemi ACIKKEN, kapi(lar) acikken VEYA depo %99+ iken SUREKLI
  //    kesik-kesik bip - kosul suruyorsa KAPI_TANK_BIP_ARALIK_MS'de bir tekrarlanir.
  // 3) Banner (alarmGenelKutu, app.js'deki alarmSimdiVar ile AYNI kosul)
  //    YENI gorunur oldugunda 10sn boyunca kesik-kesik bip, sonra durur
  //    (banner hala aktif olsa da - tek "patlama", surekli calmaz).
  // Ucu de "ilk okuma" (boot aninda zaten-true olan bir kosulu yanlislikla
  // "yeni gecis" sanip spontan bip vermek) korumali - static Once/Onceki
  // degiskenler ilk dongude sadece SEED edilir, chirp tetiklenmez.
  {
    static bool ilkBuzzerDegerlendirmesi = true;
    static bool pirOncekiDurum = false;
    static unsigned long kapiTankSonBipMs = 0;
    static unsigned long bannerBipBaslangicMs = 0; // 0 = patlama aktif degil
    static unsigned long bannerBipSonMs = 0;
    const unsigned long KAPI_TANK_BIP_ARALIK_MS = 1500UL;
    const unsigned long BANNER_BIP_ARALIK_MS = 1000UL;
    const unsigned long BANNER_BIP_SURE_MS = 10000UL;
    unsigned long simdiBuzzerMs = millis();
    bool alarmSistemiAcik = ayar.alarmRoleAktif;

    if (!ilkBuzzerDegerlendirmesi && alarmSistemiAcik && pirAcik && !pirOncekiDurum) {
      buzzerChirpBekliyor = true;
    }
    pirOncekiDurum = pirAcik;

