Nedu41/SuDepoSis_v2/esp8266_slave/src/main.cpp
    bool kapiTankVar = alarmSistemiAcik && (kapi1Acik || kapi2Acik || sonYuzde >= 99.0);
    if (kapiTankVar && (simdiBuzzerMs - kapiTankSonBipMs >= KAPI_TANK_BIP_ARALIK_MS)) {
      buzzerChirpBekliyor = true;
      kapiTankSonBipMs = simdiBuzzerMs;
    }

    bool bannerAlarmVar = (alarmTetikleyenMask != 0) || alarmOnayBekliyor || panicRoleAktif;
    if (!ilkBuzzerDegerlendirmesi && bannerAlarmVar && !bannerAlarmOncekiDurum) {
      bannerBipBaslangicMs = simdiBuzzerMs;
      bannerBipSonMs = 0;
    }
    // FIX (kullanici sikayeti, 2026-08-27 - "kapi kapatinca alarm gec
    // susuyor"): eskiden banner/rolenin durum degisikligi tarayiciya SADECE
    // periyodik 4sn'lik otomatik ssePush()'ta yansiyordu - kapi fiziksel
    // olarak kapanip triggerActive false olsa, buzzer/role aninda tepki
    // verse bile web sayfasi (SSE) bunu gormek icin 4sn'ye kadar bekliyordu.
    // Artik banner GORUNURLUGU veya role/susturma durumu her DEGISTIGINDE
    // aninda push ediliyor - dugmeye basmaya gerek yok, sensor kaynakli
    // degisiklikler de aninda yansir.
    {
      static bool oncekiRoleFizikselDurum = false;
      static bool oncekiAlarmSusturuldu = false;
      static bool ilkDurumPushu = true;
      if (!ilkDurumPushu && (bannerAlarmVar != bannerAlarmOncekiDurum || roleFizikselDurum != oncekiRoleFizikselDurum || alarmSusturuldu != oncekiAlarmSusturuldu)) {
        ssePush();
      }
      oncekiRoleFizikselDurum = roleFizikselDurum;
      oncekiAlarmSusturuldu = alarmSusturuldu;
      ilkDurumPushu = false;
    }
    bannerAlarmOncekiDurum = bannerAlarmVar;
    if (bannerBipBaslangicMs != 0) {
      if (simdiBuzzerMs - bannerBipBaslangicMs >= BANNER_BIP_SURE_MS) {
        bannerBipBaslangicMs = 0; // 10sn doldu, patlama bitti
      } else if (simdiBuzzerMs - bannerBipSonMs >= BANNER_BIP_ARALIK_MS) {
        buzzerChirpBekliyor = true;
        bannerBipSonMs = simdiBuzzerMs;
      }
    }

    ilkBuzzerDegerlendirmesi = false;
  }
  alarmLoguKontrolEt();
  // ALARM LAMBA FLASI - role fiziksel olarak tetikliyken (panik dahil) lamba
  // yanip soner; role kapaninca lamba tetiklenmeden onceki durumuna doner.
  // Kendi !nanoMesgul kontrolünü ayrı yapar ki yukarıdaki role komutu
  // kuyruğu meşgul ettiğinde bu döngüde beklesin, bir sonrakinde devam etsin.
  // Lamba, artik yukarida hesaplanan alarmCikisLambaIstenen'e gore yanip
  // sonuyor (mod cikis ayarindan geliyor) - roleFizikselDurum'a bagimli
  // DEGIL, boylece "siren acik, lamba kapali" gibi kombinasyonlar da
  // dogru calisir (eskiden lamba sadece siren fiziksel olarak tetiklenince
  // yanip soner, Sessiz modda hicbir zaman yanmazdi).
  if (alarmCikisLambaIstenen) {
    if (!lambaFlashAktif) {
      lambaFlashAktif = true;
      lambaFlashOncekiManuel = lambaAcik;
      lambaFlashSonDegisimMs = millis();
    } else if (!nanoMesgul && millis() - lambaFlashSonDegisimMs >= LAMBA_FLASH_ARALIK_MS) {
      lambaFlashSonDegisimMs = millis();
      nanoLambaKontrol(!lambaAcik);
    }
  } else if (lambaFlashAktif) {
    // FIX: lambaFlashAktif eskiden burada kosulsuz false yapiliyordu - alarm
    // tam bu anda role kapatma komutuyla (yukarida) ayni donguye denk gelip
    // nanoMesgul mesgul ciktiginda geri donus komutu hic gonderilmiyor ve bir
    // daha da denenmiyordu (lambaFlashAktif zaten false, bu blok tekrar
    // calismiyordu) - lamba flaşin son anindaki (rastgele acik/kapali)
    // durumunda kilitli kaliyordu. Simdi nanoMesgul bosalana kadar her
    // dongude tekrar denenir, basarili gonderilince flag temizlenir.
    if (!nanoMesgul) {
      nanoLambaKontrol(lambaFlashOncekiManuel);
      lambaFlashAktif = false;
    }
  }
  server.handleClient();  // FIX: Röle kontrol sonrası web isteklerini işle
  unsigned long s = millis();
  uint16_t a = geceModuMu() ? ayar.olcumAraligiGece : ayar.olcumAraligiGunduz;
  if (s - sonOtomatikOlcumMs >= (unsigned long)a * 1000UL) { olcumYap(); sonOtomatikOlcumMs = s; ssePush(); server.handleClient(); }
  // SSE periyodik durum guncelleme - onceden 1500ms'de bir moistureOku()
  // (gercek analogRead) cagiriyordu, yani nem sensoru gereksiz sik
  // okunuyordu (yorumun soyledigi "olcum yapmadan sadece durum iter"in
  // aksine). Kullanici istegiyle 4000ms'e yavaslatildi - ekranda hala
  // akici hissettirecek kadar sik, ama analogRead sıklığı ~2.7 kat azaldi.
  static unsigned long sseGonderMs = 0;
  if (s - sseGonderMs >= 4000UL) { sseGonderMs = s; moistureOkuOtomatik(); ssePush(); }
  // KALDIRILDI: Periyodik (1000ms) istem-disi masterGonder() gonderimi.
  // ESP32 zaten kendi 600ms'lik dongusunde GET_STATUS ile surekli soruyor
  // (bkz esp32_master rs485_poll) - bu "yedek" gonderim aslinda ESP32'nin
  // istegiyle SENKRONIZE OLMADAN, paylasilan yari-cift-yonlu RS485 hattina
  // ikinci, kontrolsuz bir vericiydi. ESP32 tarafinda [RS485_TIMING] tani
  // loguyla dogrulandi: SET_LAMBA gibi komutlar bazen tek denemede 40ms'de
  // basariyorken, bazen 1-3 saniyeye (2-3 yeniden deneme) uzuyordu - suresi
  // rastgele degisen bu orunun, iki bagimsiz zamanlayicinin hatta cakismasiyla
  // (bu gonderim + ESP32'nin sorgusu/komutu ayni ana denk gelince) uyustugu
  // gorulmustu. ESP32'nin poll'u zaten 600ms'de bir taze veri getirdigi icin
  // bu "yedek" gereksizdi - kaldirilmasi hem cakismayi hem gecikmeyi azaltmali.
  server.handleClient();
}